cozycactus/llvm-project/llvm/unittests/Target/AVR32/TargetInfoTest.cpp
  EXPECT_EQ(MII->get(AVR32::LD_W_QS_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::LD_D_PostInc).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::LD_D_PreDec).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::LD_D_Reg).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::LD_D_Disp16).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::LD_D_IndexShift).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::LDCM_D).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::LDCM_D_UPD).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::LDCM_W_High).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::LDCM_W_High_UPD).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::LDCM_W_Low).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::LDCM_W_Low_UPD).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::LDDPC).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::LDDSP).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::LDINS_B).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::LDINS_H).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::LDSWP_SH_Disp12).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::LDSWP_UH_Disp12).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::LDSWP_W_Disp12).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::LD_SB_Disp16).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::LD_SB_IndexShift).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::LD_SB_AL_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::LD_SB_EQ_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::LD_SB_NE_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::LD_SB_CC_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::LD_SB_HS_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::LD_SB_CS_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::LD_SB_LO_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::LD_SB_GE_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::LD_SB_LT_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::LD_SB_MI_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::LD_SB_PL_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::LD_SB_LS_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::LD_SB_GT_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::LD_SB_LE_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::LD_SB_HI_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::LD_SB_VS_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::LD_SB_VC_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::LD_SB_QS_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::LD_UB_PostInc).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::LD_UB_PreDec).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::LD_UB_Disp3).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::LD_UB_Disp16).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::LD_UB_IndexShift).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::LD_UB_AL_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::LD_UB_EQ_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::LD_UB_NE_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::LD_UB_CC_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::LD_UB_HS_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::LD_UB_CS_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::LD_UB_LO_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::LD_UB_GE_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::LD_UB_LT_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::LD_UB_MI_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::LD_UB_PL_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::LD_UB_LS_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::LD_UB_GT_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::LD_UB_LE_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::LD_UB_HI_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::LD_UB_VS_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::LD_UB_VC_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::LD_UB_QS_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::LD_SH_PostInc).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::LD_SH_PreDec).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::LD_SH_Disp3).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::LD_SH_Disp16).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::LD_SH_IndexShift).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::LD_SH_AL_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::LD_SH_EQ_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::LD_SH_NE_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::LD_SH_CC_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::LD_SH_HS_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::LD_SH_CS_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::LD_SH_LO_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::LD_SH_GE_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::LD_SH_LT_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::LD_SH_MI_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::LD_SH_PL_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::LD_SH_LS_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::LD_SH_GT_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::LD_SH_LE_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::LD_SH_HI_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::LD_SH_VS_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::LD_SH_VC_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::LD_SH_QS_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::LD_UH_PostInc).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::LD_UH_PreDec).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::LD_UH_Disp3).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::LD_UH_Disp16).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::LD_UH_IndexShift).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::LD_UH_AL_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::LD_UH_EQ_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::LD_UH_NE_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::LD_UH_CC_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::LD_UH_HS_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::LD_UH_CS_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::LD_UH_LO_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::LD_UH_GE_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::LD_UH_LT_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::LD_UH_MI_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::LD_UH_PL_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::LD_UH_LS_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::LD_UH_GT_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::LD_UH_LE_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::LD_UH_HI_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::LD_UH_VS_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::LD_UH_VC_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::LD_UH_QS_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_B_PostInc).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::ST_B_PreDec).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::ST_B_Disp3).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::ST_B_Disp16).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_B_IndexShift).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_B_AL_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_B_EQ_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_B_NE_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_B_CC_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_B_HS_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_B_CS_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_B_LO_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_B_GE_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_B_LT_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_B_MI_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_B_PL_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_B_LS_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_B_GT_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_B_LE_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_B_HI_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_B_VS_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_B_VC_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_B_QS_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_D_PostInc).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::ST_D_PreDec).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::ST_D_Reg).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::ST_D_Disp16).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_D_IndexShift).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_H_PostInc).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::ST_H_PreDec).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::ST_H_Disp3).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::ST_H_Disp16).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_H_IndexShift).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_H_AL_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_H_EQ_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_H_NE_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_H_CC_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_H_HS_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_H_CS_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_H_LO_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_H_GE_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_H_LT_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_H_MI_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_H_PL_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_H_LS_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_H_GT_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_H_LE_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_H_HI_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_H_VS_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_H_VC_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_H_QS_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_W_PostInc).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::ST_W_PreDec).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::ST_W_Disp4).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::ST_W_Disp16).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_W_IndexShift).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_W_AL_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_W_EQ_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_W_NE_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_W_CC_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_W_HS_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_W_CS_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_W_LO_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_W_GE_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_W_LT_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_W_MI_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_W_PL_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_W_LS_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_W_GT_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_W_LE_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_W_HI_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_W_VS_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_W_VC_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_W_QS_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::STC_D_Disp).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::STC_D_PostInc).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::STC_D_IndexShift).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::STC_W_Disp).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::STC_W_PostInc).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::STC_W_IndexShift).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::STC0_D_Disp).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::STC0_W_Disp).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::STCOND).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::STDSP).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::STHH_W_Disp8).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::STHH_W_IndexShift).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::STSWP_H_Disp12).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::STSWP_W_Disp12).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::STM).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::STM_PRE).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::STMTS).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::STMTS_PRE).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::STCM_D).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::STCM_D_PRE).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::STCM_W_High).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::STCM_W_High_PRE).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::STCM_W_Low).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::STCM_W_Low_PRE).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBALrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBCCrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBCSrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBEQrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBGErrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBGTrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBHIrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBHSrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBLErrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBLOrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBLSrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBLTrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBMIrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBNErrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBPLrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBQSrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBVCrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBVSrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBALri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBCCri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBCSri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBEQri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBGEri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBGTri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBHIri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBHSri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBLEri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBLOri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBLSri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBLTri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBMIri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBNEri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBPLri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBQSri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBVCri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBVSri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBFALri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBFCCri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBFCSri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBFEQri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBFGEri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBFGTri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBFHIri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBFHSri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBFLEri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBFLOri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBFLSri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBFLTri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBFMIri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBFNEri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBFPLri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBFQSri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBFVCri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBFVSri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBHH_W).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBSPri8).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::SUBri8).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::SUBrrrs).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBrri16).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBri21).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBrr).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::SWAP_BHr).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::SWAP_Br).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::SWAP_Hr).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::SYNCi).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::TLBR).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::TLBS).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::TLBW).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::TNBZr).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::TSTrr).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::XCHGrrr).getSize(), 4u);

  auto ExpectFixedReturn = [&](unsigned Opcode) {
    const MCInstrDesc &Desc = MII->get(Opcode);
    EXPECT_TRUE(Desc.isReturn());
    EXPECT_TRUE(Desc.isTerminator());
    EXPECT_TRUE(Desc.isBarrier());
    EXPECT_FALSE(Desc.isBranch());
  };

  for (unsigned Opcode :
       {AVR32::RETD, AVR32::RETE, AVR32::RETJ, AVR32::RETS, AVR32::RETSS})
    ExpectFixedReturn(Opcode);

