cozycactus/llvm-project/llvm/unittests/Target/AVR32/TargetInfoTest.cpp
  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(Incjosp, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 2u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xd6);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xf3);

  MCInst Mcall;
  Mcall.setOpcode(AVR32::MCALL);
  Mcall.addOperand(MCOperand::createReg(AVR32::R1));
  Mcall.addOperand(MCOperand::createImm(-4));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(Mcall, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xf0);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x11);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0xff);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0xff);

  MCInst LdWPostInc;
  LdWPostInc.setOpcode(AVR32::LD_W_PostInc);
  LdWPostInc.addOperand(MCOperand::createReg(AVR32::R1));
  LdWPostInc.addOperand(MCOperand::createReg(AVR32::R2));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(LdWPostInc, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 2u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0x05);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x01);

  MCInst LdWPreDec;
  LdWPreDec.setOpcode(AVR32::LD_W_PreDec);
  LdWPreDec.addOperand(MCOperand::createReg(AVR32::R1));
  LdWPreDec.addOperand(MCOperand::createReg(AVR32::R2));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(LdWPreDec, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 2u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0x05);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x41);

  MCInst LdWDisp5;
  LdWDisp5.setOpcode(AVR32::LD_W_Disp5);
  LdWDisp5.addOperand(MCOperand::createReg(AVR32::R1));
  LdWDisp5.addOperand(MCOperand::createReg(AVR32::R2));
  LdWDisp5.addOperand(MCOperand::createImm(12));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(LdWDisp5, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 2u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0x64);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x31);

  MCInst LdWDisp16;
  LdWDisp16.setOpcode(AVR32::LD_W_Disp16);
  LdWDisp16.addOperand(MCOperand::createReg(AVR32::R1));
  LdWDisp16.addOperand(MCOperand::createReg(AVR32::R2));
  LdWDisp16.addOperand(MCOperand::createImm(-1));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(LdWDisp16, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xf1);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0xff);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0xff);

  MCInst LdWIndexShift;
  LdWIndexShift.setOpcode(AVR32::LD_W_IndexShift);
  LdWIndexShift.addOperand(MCOperand::createReg(AVR32::R1));
  LdWIndexShift.addOperand(MCOperand::createReg(AVR32::R2));
  LdWIndexShift.addOperand(MCOperand::createReg(AVR32::R3));
  LdWIndexShift.addOperand(MCOperand::createImm(2));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(LdWIndexShift, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x21);

  MCInst LdWIndexPart;
  LdWIndexPart.setOpcode(AVR32::LD_W_IndexPart);
  LdWIndexPart.addOperand(MCOperand::createReg(AVR32::R1));
  LdWIndexPart.addOperand(MCOperand::createReg(AVR32::R2));
  LdWIndexPart.addOperand(MCOperand::createReg(AVR32::R3));
  LdWIndexPart.addOperand(MCOperand::createImm(1));
  LdWIndexPart.addOperand(MCOperand::createImm(2));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(LdWIndexPart, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x0f);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x91);

  MCInst LdWEqDisp9;
  LdWEqDisp9.setOpcode(AVR32::LD_W_EQ_Disp9);
  LdWEqDisp9.addOperand(MCOperand::createReg(AVR32::R1));
  LdWEqDisp9.addOperand(MCOperand::createReg(AVR32::R2));
  LdWEqDisp9.addOperand(MCOperand::createImm(12));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(LdWEqDisp9, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe3);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xf2);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x00);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x03);

  MCInst LdWAlDisp9;
  LdWAlDisp9.setOpcode(AVR32::LD_W_AL_Disp9);
  LdWAlDisp9.addOperand(MCOperand::createReg(AVR32::R1));
  LdWAlDisp9.addOperand(MCOperand::createReg(AVR32::R2));
  LdWAlDisp9.addOperand(MCOperand::createImm(12));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(LdWAlDisp9, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe3);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xf2);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0xf0);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x03);

  MCInst LdDPostInc;
  LdDPostInc.setOpcode(AVR32::LD_D_PostInc);
  LdDPostInc.addOperand(MCOperand::createReg(AVR32::R2));
  LdDPostInc.addOperand(MCOperand::createReg(AVR32::R1));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(LdDPostInc, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 2u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xa3);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);

  MCInst LdDPreDec;
  LdDPreDec.setOpcode(AVR32::LD_D_PreDec);
  LdDPreDec.addOperand(MCOperand::createReg(AVR32::R2));
  LdDPreDec.addOperand(MCOperand::createReg(AVR32::R1));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(LdDPreDec, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 2u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xa3);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x12);

  MCInst LdDReg;
  LdDReg.setOpcode(AVR32::LD_D_Reg);
  LdDReg.addOperand(MCOperand::createReg(AVR32::R2));
  LdDReg.addOperand(MCOperand::createReg(AVR32::R1));

