cozycactus/llvm-project/llvm/unittests/Target/AVR32/TargetInfoTest.cpp
  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(LdSHPreDec, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 2u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0x05);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x51);

  MCInst LdSHDisp3;
  LdSHDisp3.setOpcode(AVR32::LD_SH_Disp3);
  LdSHDisp3.addOperand(MCOperand::createReg(AVR32::R1));
  LdSHDisp3.addOperand(MCOperand::createReg(AVR32::R2));
  LdSHDisp3.addOperand(MCOperand::createImm(6));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(LdSHDisp3, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 2u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0x84);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x31);

  MCInst LdSHDisp16;
  LdSHDisp16.setOpcode(AVR32::LD_SH_Disp16);
  LdSHDisp16.addOperand(MCOperand::createReg(AVR32::R1));
  LdSHDisp16.addOperand(MCOperand::createReg(AVR32::R2));
  LdSHDisp16.addOperand(MCOperand::createImm(-1));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(LdSHDisp16, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe5);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x01);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0xff);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0xff);

  MCInst LdSHIndexShift;
  LdSHIndexShift.setOpcode(AVR32::LD_SH_IndexShift);
  LdSHIndexShift.addOperand(MCOperand::createReg(AVR32::R1));
  LdSHIndexShift.addOperand(MCOperand::createReg(AVR32::R2));
  LdSHIndexShift.addOperand(MCOperand::createReg(AVR32::R3));
  LdSHIndexShift.addOperand(MCOperand::createImm(2));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(LdSHIndexShift, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x04);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x21);

  MCInst LdSHEqDisp9;
  LdSHEqDisp9.setOpcode(AVR32::LD_SH_EQ_Disp9);
  LdSHEqDisp9.addOperand(MCOperand::createReg(AVR32::R1));
  LdSHEqDisp9.addOperand(MCOperand::createReg(AVR32::R2));
  LdSHEqDisp9.addOperand(MCOperand::createImm(6));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(LdSHEqDisp9, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe3);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xf2);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x02);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x03);

  MCInst LdSHAlDisp9;
  LdSHAlDisp9.setOpcode(AVR32::LD_SH_AL_Disp9);
  LdSHAlDisp9.addOperand(MCOperand::createReg(AVR32::R1));
  LdSHAlDisp9.addOperand(MCOperand::createReg(AVR32::R2));
  LdSHAlDisp9.addOperand(MCOperand::createImm(6));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(LdSHAlDisp9, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe3);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xf2);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0xf2);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x03);

  MCInst LdUHPostInc;
  LdUHPostInc.setOpcode(AVR32::LD_UH_PostInc);
  LdUHPostInc.addOperand(MCOperand::createReg(AVR32::R1));
  LdUHPostInc.addOperand(MCOperand::createReg(AVR32::R2));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(LdUHPostInc, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 2u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0x05);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x21);

  MCInst LdUHPreDec;
  LdUHPreDec.setOpcode(AVR32::LD_UH_PreDec);
  LdUHPreDec.addOperand(MCOperand::createReg(AVR32::R1));
  LdUHPreDec.addOperand(MCOperand::createReg(AVR32::R2));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(LdUHPreDec, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 2u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0x05);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x61);

  MCInst LdUHDisp3;
  LdUHDisp3.setOpcode(AVR32::LD_UH_Disp3);
  LdUHDisp3.addOperand(MCOperand::createReg(AVR32::R1));
  LdUHDisp3.addOperand(MCOperand::createReg(AVR32::R2));
  LdUHDisp3.addOperand(MCOperand::createImm(6));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(LdUHDisp3, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 2u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0x84);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xb1);

  MCInst LdUHDisp16;
  LdUHDisp16.setOpcode(AVR32::LD_UH_Disp16);
  LdUHDisp16.addOperand(MCOperand::createReg(AVR32::R1));
  LdUHDisp16.addOperand(MCOperand::createReg(AVR32::R2));
  LdUHDisp16.addOperand(MCOperand::createImm(-1));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(LdUHDisp16, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe5);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x11);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0xff);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0xff);

  MCInst LdUHIndexShift;
  LdUHIndexShift.setOpcode(AVR32::LD_UH_IndexShift);
  LdUHIndexShift.addOperand(MCOperand::createReg(AVR32::R1));
  LdUHIndexShift.addOperand(MCOperand::createReg(AVR32::R2));
  LdUHIndexShift.addOperand(MCOperand::createReg(AVR32::R3));
  LdUHIndexShift.addOperand(MCOperand::createImm(2));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(LdUHIndexShift, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x05);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x21);

  MCInst LdUHEqDisp9;
  LdUHEqDisp9.setOpcode(AVR32::LD_UH_EQ_Disp9);
  LdUHEqDisp9.addOperand(MCOperand::createReg(AVR32::R1));
  LdUHEqDisp9.addOperand(MCOperand::createReg(AVR32::R2));
  LdUHEqDisp9.addOperand(MCOperand::createImm(6));

