cozycactus/llvm-project/llvm/unittests/Target/AVR32/TargetInfoTest.cpp
  MCInst LdcmWHighUpd;
  LdcmWHighUpd.setOpcode(AVR32::LDCM_W_High_UPD);
  LdcmWHighUpd.addOperand(MCOperand::createImm(2));
  LdcmWHighUpd.addOperand(MCOperand::createReg(AVR32::R2));
  LdcmWHighUpd.addOperand(MCOperand::createImm(0x0f00));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(LdcmWHighUpd, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xed);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xa2);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x51);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x0f);

  MCInst Stm;
  Stm.setOpcode(AVR32::STM);
  Stm.addOperand(MCOperand::createReg(AVR32::R1));
  Stm.addOperand(MCOperand::createImm(0x400f));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(Stm, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe9);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xc1);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x40);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x0f);

  MCInst StmPre;
  StmPre.setOpcode(AVR32::STM_PRE);
  StmPre.addOperand(MCOperand::createReg(AVR32::R1));
  StmPre.addOperand(MCOperand::createImm(0x400f));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(StmPre, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xeb);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xc1);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x40);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x0f);

  MCInst Stmts;
  Stmts.setOpcode(AVR32::STMTS);
  Stmts.addOperand(MCOperand::createReg(AVR32::R1));
  Stmts.addOperand(MCOperand::createImm(0x400f));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(Stmts, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xed);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xc1);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x40);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x0f);

  MCInst StmtsPre;
  StmtsPre.setOpcode(AVR32::STMTS_PRE);
  StmtsPre.addOperand(MCOperand::createReg(AVR32::R1));
  StmtsPre.addOperand(MCOperand::createImm(0x400f));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(StmtsPre, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xef);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xc1);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x40);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x0f);

  MCInst StcmD;
  StcmD.setOpcode(AVR32::STCM_D);
  StcmD.addOperand(MCOperand::createImm(2));
  StcmD.addOperand(MCOperand::createReg(AVR32::R2));
  StcmD.addOperand(MCOperand::createImm(0x03));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(StcmD, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xed);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xa2);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x45);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x03);

  MCInst StcmDPre;
  StcmDPre.setOpcode(AVR32::STCM_D_PRE);
  StcmDPre.addOperand(MCOperand::createImm(2));
  StcmDPre.addOperand(MCOperand::createReg(AVR32::R2));
  StcmDPre.addOperand(MCOperand::createImm(0x03));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(StcmDPre, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xed);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xa2);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x55);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x03);

  MCInst StcmWLow;
  StcmWLow.setOpcode(AVR32::STCM_W_Low);
  StcmWLow.addOperand(MCOperand::createImm(2));
  StcmWLow.addOperand(MCOperand::createReg(AVR32::R2));
  StcmWLow.addOperand(MCOperand::createImm(0x003c));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(StcmWLow, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xed);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xa2);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x42);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x3c);

  MCInst StcmWLowPre;
  StcmWLowPre.setOpcode(AVR32::STCM_W_Low_PRE);
  StcmWLowPre.addOperand(MCOperand::createImm(2));
  StcmWLowPre.addOperand(MCOperand::createReg(AVR32::R2));
  StcmWLowPre.addOperand(MCOperand::createImm(0x003c));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(StcmWLowPre, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xed);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xa2);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x52);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x3c);

  MCInst StcmWHigh;
  StcmWHigh.setOpcode(AVR32::STCM_W_High);
  StcmWHigh.addOperand(MCOperand::createImm(2));
  StcmWHigh.addOperand(MCOperand::createReg(AVR32::R2));
  StcmWHigh.addOperand(MCOperand::createImm(0x0f00));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(StcmWHigh, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xed);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xa2);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x43);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x0f);

  MCInst StcmWHighPre;
  StcmWHighPre.setOpcode(AVR32::STCM_W_High_PRE);
  StcmWHighPre.addOperand(MCOperand::createImm(2));
  StcmWHighPre.addOperand(MCOperand::createReg(AVR32::R2));
  StcmWHighPre.addOperand(MCOperand::createImm(0x0f00));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(StcmWHighPre, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xed);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xa2);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x53);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x0f);

