cozycactus/llvm-project/llvm/unittests/Target/AVR32/TargetInfoTest.cpp
  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(Mac, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x41);

  MCInst MacsD;
  MacsD.setOpcode(AVR32::MACS_Drrr);
  MacsD.addOperand(MCOperand::createReg(AVR32::R2));
  MacsD.addOperand(MCOperand::createReg(AVR32::R3));
  MacsD.addOperand(MCOperand::createReg(AVR32::R4));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(MacsD, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe6);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x04);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x05);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x42);

  MCInst MacuD;
  MacuD.setOpcode(AVR32::MACU_Drrr);
  MacuD.addOperand(MCOperand::createReg(AVR32::R2));
  MacuD.addOperand(MCOperand::createReg(AVR32::R3));
  MacuD.addOperand(MCOperand::createReg(AVR32::R4));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(MacuD, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe6);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x04);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x07);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x42);

  MCInst MachhD;
  MachhD.setOpcode(AVR32::MACHH_D);
  MachhD.addOperand(MCOperand::createReg(AVR32::R1));
  MachhD.addOperand(MCOperand::createReg(AVR32::R2));
  MachhD.addOperand(MCOperand::createImm(1));
  MachhD.addOperand(MCOperand::createReg(AVR32::R3));
  MachhD.addOperand(MCOperand::createImm(0));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(MachhD, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x05);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0xa1);

  MCInst MachhW;
  MachhW.setOpcode(AVR32::MACHH_W);
  MachhW.addOperand(MCOperand::createReg(AVR32::R1));
  MachhW.addOperand(MCOperand::createReg(AVR32::R2));
  MachhW.addOperand(MCOperand::createImm(1));
  MachhW.addOperand(MCOperand::createReg(AVR32::R3));
  MachhW.addOperand(MCOperand::createImm(0));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(MachhW, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x04);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0xa1);

  MCInst MulhhW;
  MulhhW.setOpcode(AVR32::MULHH_W);
  MulhhW.addOperand(MCOperand::createReg(AVR32::R1));
  MulhhW.addOperand(MCOperand::createReg(AVR32::R2));
  MulhhW.addOperand(MCOperand::createImm(1));
  MulhhW.addOperand(MCOperand::createReg(AVR32::R3));
  MulhhW.addOperand(MCOperand::createImm(0));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(MulhhW, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x07);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0xa1);

  MCInst MulnhhW;
  MulnhhW.setOpcode(AVR32::MULNHH_W);
  MulnhhW.addOperand(MCOperand::createReg(AVR32::R1));
  MulnhhW.addOperand(MCOperand::createReg(AVR32::R2));
  MulnhhW.addOperand(MCOperand::createImm(1));
  MulnhhW.addOperand(MCOperand::createReg(AVR32::R3));
  MulnhhW.addOperand(MCOperand::createImm(0));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(MulnhhW, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x01);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0xa1);

  MCInst MacwhD;
  MacwhD.setOpcode(AVR32::MACWH_D);
  MacwhD.addOperand(MCOperand::createReg(AVR32::R2));
  MacwhD.addOperand(MCOperand::createReg(AVR32::R3));
  MacwhD.addOperand(MCOperand::createReg(AVR32::R4));
  MacwhD.addOperand(MCOperand::createImm(1));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(MacwhD, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe6);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x04);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x0c);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x92);

  MCInst MulnwhD;
  MulnwhD.setOpcode(AVR32::MULNWH_D);
  MulnwhD.addOperand(MCOperand::createReg(AVR32::R2));
  MulnwhD.addOperand(MCOperand::createReg(AVR32::R3));
  MulnwhD.addOperand(MCOperand::createReg(AVR32::R4));
  MulnwhD.addOperand(MCOperand::createImm(1));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(MulnwhD, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe6);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x04);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x02);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x92);

  MCInst MulwhD;
  MulwhD.setOpcode(AVR32::MULWH_D);
  MulwhD.addOperand(MCOperand::createReg(AVR32::R2));
  MulwhD.addOperand(MCOperand::createReg(AVR32::R3));
  MulwhD.addOperand(MCOperand::createReg(AVR32::R4));
  MulwhD.addOperand(MCOperand::createImm(1));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(MulwhD, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe6);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x04);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x0d);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x92);

  MCInst MacsathhW;
  MacsathhW.setOpcode(AVR32::MACSATHH_W);
  MacsathhW.addOperand(MCOperand::createReg(AVR32::R1));
  MacsathhW.addOperand(MCOperand::createReg(AVR32::R2));
  MacsathhW.addOperand(MCOperand::createImm(1));
  MacsathhW.addOperand(MCOperand::createReg(AVR32::R3));
  MacsathhW.addOperand(MCOperand::createImm(0));

