cozycactus/llvm-project/llvm/unittests/Target/AVR32/TargetInfoTest.cpp
  MCInst PackwSH;
  PackwSH.setOpcode(AVR32::PACKW_SHrrr);
  PackwSH.addOperand(MCOperand::createReg(AVR32::R1));
  PackwSH.addOperand(MCOperand::createReg(AVR32::R2));
  PackwSH.addOperand(MCOperand::createReg(AVR32::R3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PackwSH, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x24);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x71);

  MCInst PaddB;
  PaddB.setOpcode(AVR32::PADD_Brrr);
  PaddB.addOperand(MCOperand::createReg(AVR32::R1));
  PaddB.addOperand(MCOperand::createReg(AVR32::R2));
  PaddB.addOperand(MCOperand::createReg(AVR32::R3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PaddB, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x23);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x01);

  MCInst PaddH;
  PaddH.setOpcode(AVR32::PADD_Hrrr);
  PaddH.addOperand(MCOperand::createReg(AVR32::R1));
  PaddH.addOperand(MCOperand::createReg(AVR32::R2));
  PaddH.addOperand(MCOperand::createReg(AVR32::R3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PaddH, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x20);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x01);

  MCInst PaddhUB;
  PaddhUB.setOpcode(AVR32::PADDH_UBrrr);
  PaddhUB.addOperand(MCOperand::createReg(AVR32::R1));
  PaddhUB.addOperand(MCOperand::createReg(AVR32::R2));
  PaddhUB.addOperand(MCOperand::createReg(AVR32::R3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PaddhUB, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x23);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x61);

  MCInst PaddhSH;
  PaddhSH.setOpcode(AVR32::PADDH_SHrrr);
  PaddhSH.addOperand(MCOperand::createReg(AVR32::R1));
  PaddhSH.addOperand(MCOperand::createReg(AVR32::R2));
  PaddhSH.addOperand(MCOperand::createReg(AVR32::R3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PaddhSH, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x20);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0xc1);

  MCInst PaddsUB;
  PaddsUB.setOpcode(AVR32::PADDS_UBrrr);
  PaddsUB.addOperand(MCOperand::createReg(AVR32::R1));
  PaddsUB.addOperand(MCOperand::createReg(AVR32::R2));
  PaddsUB.addOperand(MCOperand::createReg(AVR32::R3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PaddsUB, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x23);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x41);

  MCInst PaddsSB;
  PaddsSB.setOpcode(AVR32::PADDS_SBrrr);
  PaddsSB.addOperand(MCOperand::createReg(AVR32::R1));
  PaddsSB.addOperand(MCOperand::createReg(AVR32::R2));
  PaddsSB.addOperand(MCOperand::createReg(AVR32::R3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PaddsSB, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x23);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x21);

  MCInst PaddsUH;
  PaddsUH.setOpcode(AVR32::PADDS_UHrrr);
  PaddsUH.addOperand(MCOperand::createReg(AVR32::R1));
  PaddsUH.addOperand(MCOperand::createReg(AVR32::R2));
  PaddsUH.addOperand(MCOperand::createReg(AVR32::R3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PaddsUH, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x20);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x81);

  MCInst PaddsSH;
  PaddsSH.setOpcode(AVR32::PADDS_SHrrr);
  PaddsSH.addOperand(MCOperand::createReg(AVR32::R1));
  PaddsSH.addOperand(MCOperand::createReg(AVR32::R2));
  PaddsSH.addOperand(MCOperand::createReg(AVR32::R3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PaddsSH, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x20);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x41);

  MCInst PaddsubH;
  PaddsubH.setOpcode(AVR32::PADDSUB_H);
  PaddsubH.addOperand(MCOperand::createReg(AVR32::R1));
  PaddsubH.addOperand(MCOperand::createReg(AVR32::R2));
  PaddsubH.addOperand(MCOperand::createImm(1));
  PaddsubH.addOperand(MCOperand::createReg(AVR32::R3));
  PaddsubH.addOperand(MCOperand::createImm(0));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PaddsubH, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x21);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x21);

  MCInst PaddsubhSH;
  PaddsubhSH.setOpcode(AVR32::PADDSUBH_SH);
  PaddsubhSH.addOperand(MCOperand::createReg(AVR32::R1));
  PaddsubhSH.addOperand(MCOperand::createReg(AVR32::R2));
  PaddsubhSH.addOperand(MCOperand::createImm(1));
  PaddsubhSH.addOperand(MCOperand::createReg(AVR32::R3));
  PaddsubhSH.addOperand(MCOperand::createImm(0));

