cozycactus/llvm-project/llvm/unittests/Target/AVR32/TargetInfoTest.cpp
  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PaddsubhSH, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x22);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0xa1);

  MCInst PaddsubsUH;
  PaddsubsUH.setOpcode(AVR32::PADDSUBS_UH);
  PaddsubsUH.addOperand(MCOperand::createReg(AVR32::R1));
  PaddsubsUH.addOperand(MCOperand::createReg(AVR32::R2));
  PaddsubsUH.addOperand(MCOperand::createImm(1));
  PaddsubsUH.addOperand(MCOperand::createReg(AVR32::R3));
  PaddsubsUH.addOperand(MCOperand::createImm(0));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PaddsubsUH, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x22);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x21);

  MCInst PaddsubsSH;
  PaddsubsSH.setOpcode(AVR32::PADDSUBS_SH);
  PaddsubsSH.addOperand(MCOperand::createReg(AVR32::R1));
  PaddsubsSH.addOperand(MCOperand::createReg(AVR32::R2));
  PaddsubsSH.addOperand(MCOperand::createImm(1));
  PaddsubsSH.addOperand(MCOperand::createReg(AVR32::R3));
  PaddsubsSH.addOperand(MCOperand::createImm(0));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PaddsubsSH, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x21);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0xa1);

  MCInst PaddxH;
  PaddxH.setOpcode(AVR32::PADDX_Hrrr);
  PaddxH.addOperand(MCOperand::createReg(AVR32::R1));
  PaddxH.addOperand(MCOperand::createReg(AVR32::R2));
  PaddxH.addOperand(MCOperand::createReg(AVR32::R3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PaddxH, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x20);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x21);

  MCInst PaddxhSH;
  PaddxhSH.setOpcode(AVR32::PADDXH_SHrrr);
  PaddxhSH.addOperand(MCOperand::createReg(AVR32::R1));
  PaddxhSH.addOperand(MCOperand::createReg(AVR32::R2));
  PaddxhSH.addOperand(MCOperand::createReg(AVR32::R3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PaddxhSH, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x20);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0xe1);

  MCInst PaddxsUH;
  PaddxsUH.setOpcode(AVR32::PADDXS_UHrrr);
  PaddxsUH.addOperand(MCOperand::createReg(AVR32::R1));
  PaddxsUH.addOperand(MCOperand::createReg(AVR32::R2));
  PaddxsUH.addOperand(MCOperand::createReg(AVR32::R3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PaddxsUH, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x20);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0xa1);

  MCInst PaddxsSH;
  PaddxsSH.setOpcode(AVR32::PADDXS_SHrrr);
  PaddxsSH.addOperand(MCOperand::createReg(AVR32::R1));
  PaddxsSH.addOperand(MCOperand::createReg(AVR32::R2));
  PaddxsSH.addOperand(MCOperand::createReg(AVR32::R3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PaddxsSH, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x20);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x61);

  MCInst PasrB;
  PasrB.setOpcode(AVR32::PASR_Brri);
  PasrB.addOperand(MCOperand::createReg(AVR32::R1));
  PasrB.addOperand(MCOperand::createReg(AVR32::R2));
  PasrB.addOperand(MCOperand::createImm(3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PasrB, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x24);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x11);

  MCInst PasrH;
  PasrH.setOpcode(AVR32::PASR_Hrri);
  PasrH.addOperand(MCOperand::createReg(AVR32::R1));
  PasrH.addOperand(MCOperand::createReg(AVR32::R2));
  PasrH.addOperand(MCOperand::createImm(15));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PasrH, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x0f);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x24);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x41);

  MCInst PlslB;
  PlslB.setOpcode(AVR32::PLSL_Brri);
  PlslB.addOperand(MCOperand::createReg(AVR32::R1));
  PlslB.addOperand(MCOperand::createReg(AVR32::R2));
  PlslB.addOperand(MCOperand::createImm(3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PlslB, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x24);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x21);

  MCInst PlslH;
  PlslH.setOpcode(AVR32::PLSL_Hrri);
  PlslH.addOperand(MCOperand::createReg(AVR32::R1));
  PlslH.addOperand(MCOperand::createReg(AVR32::R2));
  PlslH.addOperand(MCOperand::createImm(15));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PlslH, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x0f);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x24);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x51);

