cozycactus/llvm-project/llvm/unittests/Target/AVR32/TargetInfoTest.cpp
  MCInst PlsrB;
  PlsrB.setOpcode(AVR32::PLSR_Brri);
  PlsrB.addOperand(MCOperand::createReg(AVR32::R1));
  PlsrB.addOperand(MCOperand::createReg(AVR32::R2));
  PlsrB.addOperand(MCOperand::createImm(3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PlsrB, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x24);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x31);

  MCInst PlsrH;
  PlsrH.setOpcode(AVR32::PLSR_Hrri);
  PlsrH.addOperand(MCOperand::createReg(AVR32::R1));
  PlsrH.addOperand(MCOperand::createReg(AVR32::R2));
  PlsrH.addOperand(MCOperand::createImm(15));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PlsrH, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x0f);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x24);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x61);

  MCInst PavgUB;
  PavgUB.setOpcode(AVR32::PAVG_UBrrr);
  PavgUB.addOperand(MCOperand::createReg(AVR32::R1));
  PavgUB.addOperand(MCOperand::createReg(AVR32::R2));
  PavgUB.addOperand(MCOperand::createReg(AVR32::R3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PavgUB, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x23);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0xc1);

  MCInst PavgSH;
  PavgSH.setOpcode(AVR32::PAVG_SHrrr);
  PavgSH.addOperand(MCOperand::createReg(AVR32::R1));
  PavgSH.addOperand(MCOperand::createReg(AVR32::R2));
  PavgSH.addOperand(MCOperand::createReg(AVR32::R3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PavgSH, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x23);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0xd1);

  MCInst PmaxUB;
  PmaxUB.setOpcode(AVR32::PMAX_UBrrr);
  PmaxUB.addOperand(MCOperand::createReg(AVR32::R1));
  PmaxUB.addOperand(MCOperand::createReg(AVR32::R2));
  PmaxUB.addOperand(MCOperand::createReg(AVR32::R3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PmaxUB, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x23);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x81);

  MCInst PmaxSH;
  PmaxSH.setOpcode(AVR32::PMAX_SHrrr);
  PmaxSH.addOperand(MCOperand::createReg(AVR32::R1));
  PmaxSH.addOperand(MCOperand::createReg(AVR32::R2));
  PmaxSH.addOperand(MCOperand::createReg(AVR32::R3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PmaxSH, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x23);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x91);

  MCInst PminUB;
  PminUB.setOpcode(AVR32::PMIN_UBrrr);
  PminUB.addOperand(MCOperand::createReg(AVR32::R1));
  PminUB.addOperand(MCOperand::createReg(AVR32::R2));
  PminUB.addOperand(MCOperand::createReg(AVR32::R3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PminUB, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x23);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0xa1);

  MCInst PminSH;
  PminSH.setOpcode(AVR32::PMIN_SHrrr);
  PminSH.addOperand(MCOperand::createReg(AVR32::R1));
  PminSH.addOperand(MCOperand::createReg(AVR32::R2));
  PminSH.addOperand(MCOperand::createReg(AVR32::R3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PminSH, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x23);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0xb1);

  MCInst Psad;
  Psad.setOpcode(AVR32::PSADrrr);
  Psad.addOperand(MCOperand::createReg(AVR32::R1));
  Psad.addOperand(MCOperand::createReg(AVR32::R2));
  Psad.addOperand(MCOperand::createReg(AVR32::R3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(Psad, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x24);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x01);

  MCInst PsubB;
  PsubB.setOpcode(AVR32::PSUB_Brrr);
  PsubB.addOperand(MCOperand::createReg(AVR32::R1));
  PsubB.addOperand(MCOperand::createReg(AVR32::R2));
  PsubB.addOperand(MCOperand::createReg(AVR32::R3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PsubB, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x23);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x11);

  MCInst PsubH;
  PsubH.setOpcode(AVR32::PSUB_Hrrr);
  PsubH.addOperand(MCOperand::createReg(AVR32::R1));
  PsubH.addOperand(MCOperand::createReg(AVR32::R2));
  PsubH.addOperand(MCOperand::createReg(AVR32::R3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PsubH, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x20);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x11);

