cozycactus/llvm-project/llvm/unittests/Target/AVR32/TargetInfoTest.cpp
  MCInst PsubaddH;
  PsubaddH.setOpcode(AVR32::PSUBADD_H);
  PsubaddH.addOperand(MCOperand::createReg(AVR32::R1));
  PsubaddH.addOperand(MCOperand::createReg(AVR32::R2));
  PsubaddH.addOperand(MCOperand::createImm(1));
  PsubaddH.addOperand(MCOperand::createReg(AVR32::R3));
  PsubaddH.addOperand(MCOperand::createImm(0));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PsubaddH, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x21);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x61);

  MCInst PsubaddhSH;
  PsubaddhSH.setOpcode(AVR32::PSUBADDH_SH);
  PsubaddhSH.addOperand(MCOperand::createReg(AVR32::R1));
  PsubaddhSH.addOperand(MCOperand::createReg(AVR32::R2));
  PsubaddhSH.addOperand(MCOperand::createImm(1));
  PsubaddhSH.addOperand(MCOperand::createReg(AVR32::R3));
  PsubaddhSH.addOperand(MCOperand::createImm(0));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PsubaddhSH, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x22);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0xe1);

  MCInst PsubaddsUH;
  PsubaddsUH.setOpcode(AVR32::PSUBADDS_UH);
  PsubaddsUH.addOperand(MCOperand::createReg(AVR32::R1));
  PsubaddsUH.addOperand(MCOperand::createReg(AVR32::R2));
  PsubaddsUH.addOperand(MCOperand::createImm(1));
  PsubaddsUH.addOperand(MCOperand::createReg(AVR32::R3));
  PsubaddsUH.addOperand(MCOperand::createImm(0));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PsubaddsUH, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x22);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x61);

  MCInst PsubaddsSH;
  PsubaddsSH.setOpcode(AVR32::PSUBADDS_SH);
  PsubaddsSH.addOperand(MCOperand::createReg(AVR32::R1));
  PsubaddsSH.addOperand(MCOperand::createReg(AVR32::R2));
  PsubaddsSH.addOperand(MCOperand::createImm(1));
  PsubaddsSH.addOperand(MCOperand::createReg(AVR32::R3));
  PsubaddsSH.addOperand(MCOperand::createImm(0));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PsubaddsSH, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x21);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0xe1);

  MCInst PsubhUB;
  PsubhUB.setOpcode(AVR32::PSUBH_UBrrr);
  PsubhUB.addOperand(MCOperand::createReg(AVR32::R1));
  PsubhUB.addOperand(MCOperand::createReg(AVR32::R2));
  PsubhUB.addOperand(MCOperand::createReg(AVR32::R3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PsubhUB, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x23);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x71);

  MCInst PsubhSH;
  PsubhSH.setOpcode(AVR32::PSUBH_SHrrr);
  PsubhSH.addOperand(MCOperand::createReg(AVR32::R1));
  PsubhSH.addOperand(MCOperand::createReg(AVR32::R2));
  PsubhSH.addOperand(MCOperand::createReg(AVR32::R3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PsubhSH, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x20);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0xd1);

  MCInst PsubsUB;
  PsubsUB.setOpcode(AVR32::PSUBS_UBrrr);
  PsubsUB.addOperand(MCOperand::createReg(AVR32::R1));
  PsubsUB.addOperand(MCOperand::createReg(AVR32::R2));
  PsubsUB.addOperand(MCOperand::createReg(AVR32::R3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PsubsUB, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x23);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x51);

  MCInst PsubsSB;
  PsubsSB.setOpcode(AVR32::PSUBS_SBrrr);
  PsubsSB.addOperand(MCOperand::createReg(AVR32::R1));
  PsubsSB.addOperand(MCOperand::createReg(AVR32::R2));
  PsubsSB.addOperand(MCOperand::createReg(AVR32::R3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PsubsSB, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x23);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x31);

  MCInst PsubsUH;
  PsubsUH.setOpcode(AVR32::PSUBS_UHrrr);
  PsubsUH.addOperand(MCOperand::createReg(AVR32::R1));
  PsubsUH.addOperand(MCOperand::createReg(AVR32::R2));
  PsubsUH.addOperand(MCOperand::createReg(AVR32::R3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PsubsUH, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x20);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x91);

  MCInst PsubsSH;
  PsubsSH.setOpcode(AVR32::PSUBS_SHrrr);
  PsubsSH.addOperand(MCOperand::createReg(AVR32::R1));
  PsubsSH.addOperand(MCOperand::createReg(AVR32::R2));
  PsubsSH.addOperand(MCOperand::createReg(AVR32::R3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PsubsSH, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x20);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x51);

  MCInst PsubxH;
  PsubxH.setOpcode(AVR32::PSUBX_Hrrr);
  PsubxH.addOperand(MCOperand::createReg(AVR32::R1));
  PsubxH.addOperand(MCOperand::createReg(AVR32::R2));
  PsubxH.addOperand(MCOperand::createReg(AVR32::R3));

