cozycactus/llvm-project/llvm/unittests/Target/AVR32/TargetInfoTest.cpp
  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(StHDisp16, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe3);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x52);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0xff);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0xff);

  MCInst StHIndexShift;
  StHIndexShift.setOpcode(AVR32::ST_H_IndexShift);
  StHIndexShift.addOperand(MCOperand::createReg(AVR32::R1));
  StHIndexShift.addOperand(MCOperand::createReg(AVR32::R2));
  StHIndexShift.addOperand(MCOperand::createImm(3));
  StHIndexShift.addOperand(MCOperand::createReg(AVR32::R4));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(StHIndexShift, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe2);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x02);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x0a);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x34);

  MCInst StHEqDisp9;
  StHEqDisp9.setOpcode(AVR32::ST_H_EQ_Disp9);
  StHEqDisp9.addOperand(MCOperand::createReg(AVR32::R1));
  StHEqDisp9.addOperand(MCOperand::createImm(6));
  StHEqDisp9.addOperand(MCOperand::createReg(AVR32::R2));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(StHEqDisp9, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe3);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xf2);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x0c);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x03);

  MCInst StHAlDisp9;
  StHAlDisp9.setOpcode(AVR32::ST_H_AL_Disp9);
  StHAlDisp9.addOperand(MCOperand::createReg(AVR32::R1));
  StHAlDisp9.addOperand(MCOperand::createImm(6));
  StHAlDisp9.addOperand(MCOperand::createReg(AVR32::R2));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(StHAlDisp9, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe3);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xf2);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0xfc);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x03);

  MCInst StWPostInc;
  StWPostInc.setOpcode(AVR32::ST_W_PostInc);
  StWPostInc.addOperand(MCOperand::createReg(AVR32::R1));
  StWPostInc.addOperand(MCOperand::createReg(AVR32::R2));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(StWPostInc, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 2u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0x02);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xa2);

  MCInst StWPreDec;
  StWPreDec.setOpcode(AVR32::ST_W_PreDec);
  StWPreDec.addOperand(MCOperand::createReg(AVR32::R1));
  StWPreDec.addOperand(MCOperand::createReg(AVR32::R2));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(StWPreDec, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 2u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0x02);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xd2);

  MCInst StWDisp4;
  StWDisp4.setOpcode(AVR32::ST_W_Disp4);
  StWDisp4.addOperand(MCOperand::createReg(AVR32::R1));
  StWDisp4.addOperand(MCOperand::createImm(12));
  StWDisp4.addOperand(MCOperand::createReg(AVR32::R2));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(StWDisp4, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 2u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0x83);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x32);

  MCInst StWDisp16;
  StWDisp16.setOpcode(AVR32::ST_W_Disp16);
  StWDisp16.addOperand(MCOperand::createReg(AVR32::R1));
  StWDisp16.addOperand(MCOperand::createImm(-1));
  StWDisp16.addOperand(MCOperand::createReg(AVR32::R2));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(StWDisp16, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe3);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x42);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0xff);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0xff);

  MCInst StWIndexShift;
  StWIndexShift.setOpcode(AVR32::ST_W_IndexShift);
  StWIndexShift.addOperand(MCOperand::createReg(AVR32::R1));
  StWIndexShift.addOperand(MCOperand::createReg(AVR32::R2));
  StWIndexShift.addOperand(MCOperand::createImm(3));
  StWIndexShift.addOperand(MCOperand::createReg(AVR32::R4));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(StWIndexShift, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe2);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x02);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x09);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x34);

  MCInst StWEqDisp9;
  StWEqDisp9.setOpcode(AVR32::ST_W_EQ_Disp9);
  StWEqDisp9.addOperand(MCOperand::createReg(AVR32::R1));
  StWEqDisp9.addOperand(MCOperand::createImm(12));
  StWEqDisp9.addOperand(MCOperand::createReg(AVR32::R2));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(StWEqDisp9, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe3);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xf2);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x0a);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x03);

  MCInst StWAlDisp9;
  StWAlDisp9.setOpcode(AVR32::ST_W_AL_Disp9);
  StWAlDisp9.addOperand(MCOperand::createReg(AVR32::R1));
  StWAlDisp9.addOperand(MCOperand::createImm(12));
  StWAlDisp9.addOperand(MCOperand::createReg(AVR32::R2));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(StWAlDisp9, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe3);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xf2);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0xfa);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x03);

  MCInst Stcond;
  Stcond.setOpcode(AVR32::STCOND);
  Stcond.addOperand(MCOperand::createReg(AVR32::R1));
  Stcond.addOperand(MCOperand::createImm(-1));
  Stcond.addOperand(MCOperand::createReg(AVR32::R2));

