cozycactus/llvm-project/llvm/unittests/Target/AVR32/TargetInfoTest.cpp
  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(MovAlImm, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xf9);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xb1);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x0f);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0xff);

  MCInst MovImm;
  MovImm.setOpcode(AVR32::MOVri8);
  MovImm.addOperand(MCOperand::createReg(AVR32::R1));
  MovImm.addOperand(MCOperand::createImm(-1));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(MovImm, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 2u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0x3f);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xf1);

  MCInst MovImm21;
  MovImm21.setOpcode(AVR32::MOVri21);
  MovImm21.addOperand(MCOperand::createReg(AVR32::R1));
  MovImm21.addOperand(MCOperand::createImm(32));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(MovImm21, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe0);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x61);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x00);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x20);

  MCInst Movh;
  Movh.setOpcode(AVR32::MOVHri);
  Movh.addOperand(MCOperand::createReg(AVR32::R1));
  Movh.addOperand(MCOperand::createImm(1));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(Movh, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xfc);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x11);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x00);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x01);

  MCInst Cop;
  Cop.setOpcode(AVR32::COP);
  Cop.addOperand(MCOperand::createImm(2));
  Cop.addOperand(MCOperand::createImm(1));
  Cop.addOperand(MCOperand::createImm(3));
  Cop.addOperand(MCOperand::createImm(4));
  Cop.addOperand(MCOperand::createImm(0x55));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(Cop, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe3);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xa5);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x51);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x34);

  MCInst MvcrD;
  MvcrD.setOpcode(AVR32::MVCRd);
  MvcrD.addOperand(MCOperand::createReg(AVR32::R0));
  MvcrD.addOperand(MCOperand::createImm(2));
  MvcrD.addOperand(MCOperand::createImm(2));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(MvcrD, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xef);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xa0);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x42);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x10);

  MCInst MvcrW;
  MvcrW.setOpcode(AVR32::MVCRw);
  MvcrW.addOperand(MCOperand::createReg(AVR32::R1));
  MvcrW.addOperand(MCOperand::createImm(2));
  MvcrW.addOperand(MCOperand::createImm(3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(MvcrW, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xef);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xa1);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x43);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x00);

  MCInst MvrcD;
  MvrcD.setOpcode(AVR32::MVRCd);
  MvrcD.addOperand(MCOperand::createImm(2));
  MvrcD.addOperand(MCOperand::createImm(0));
  MvrcD.addOperand(MCOperand::createReg(AVR32::R2));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(MvrcD, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xef);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xa2);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x40);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x18);

  MCInst MvrcW;
  MvrcW.setOpcode(AVR32::MVRCw);
  MvrcW.addOperand(MCOperand::createImm(2));
  MvrcW.addOperand(MCOperand::createImm(3));
  MvrcW.addOperand(MCOperand::createReg(AVR32::R1));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(MvrcW, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xef);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xa1);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x43);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x20);

  MCInst LdcDDisp;
  LdcDDisp.setOpcode(AVR32::LDC_D_Disp);
  LdcDDisp.addOperand(MCOperand::createImm(2));
  LdcDDisp.addOperand(MCOperand::createImm(0));
  LdcDDisp.addOperand(MCOperand::createReg(AVR32::R2));
  LdcDDisp.addOperand(MCOperand::createImm(0));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(LdcDDisp, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe9);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xa2);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x50);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x00);

  MCInst LdcDPreDec;
  LdcDPreDec.setOpcode(AVR32::LDC_D_PreDec);
  LdcDPreDec.addOperand(MCOperand::createImm(2));
  LdcDPreDec.addOperand(MCOperand::createImm(0));
  LdcDPreDec.addOperand(MCOperand::createReg(AVR32::R2));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(LdcDPreDec, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xef);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xa2);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x40);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x50);

  MCInst LdcDIndexShift;
  LdcDIndexShift.setOpcode(AVR32::LDC_D_IndexShift);
  LdcDIndexShift.addOperand(MCOperand::createImm(2));
  LdcDIndexShift.addOperand(MCOperand::createImm(0));
  LdcDIndexShift.addOperand(MCOperand::createReg(AVR32::R2));
  LdcDIndexShift.addOperand(MCOperand::createReg(AVR32::R3));
  LdcDIndexShift.addOperand(MCOperand::createImm(1));

