cozycactus/llvm-project/llvm/unittests/Target/AVR32/TargetInfoTest.cpp
  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(LdcDIndexShift, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xef);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xa2);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x50);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x53);

  MCInst LdcWDisp;
  LdcWDisp.setOpcode(AVR32::LDC_W_Disp);
  LdcWDisp.addOperand(MCOperand::createImm(2));
  LdcWDisp.addOperand(MCOperand::createImm(3));
  LdcWDisp.addOperand(MCOperand::createReg(AVR32::R2));
  LdcWDisp.addOperand(MCOperand::createImm(4));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(LdcWDisp, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe9);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xa2);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x43);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x01);

  MCInst LdcWPreDec;
  LdcWPreDec.setOpcode(AVR32::LDC_W_PreDec);
  LdcWPreDec.addOperand(MCOperand::createImm(2));
  LdcWPreDec.addOperand(MCOperand::createImm(3));
  LdcWPreDec.addOperand(MCOperand::createReg(AVR32::R2));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(LdcWPreDec, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xef);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xa2);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x43);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x40);

  MCInst LdcWIndexShift;
  LdcWIndexShift.setOpcode(AVR32::LDC_W_IndexShift);
  LdcWIndexShift.addOperand(MCOperand::createImm(2));
  LdcWIndexShift.addOperand(MCOperand::createImm(3));
  LdcWIndexShift.addOperand(MCOperand::createReg(AVR32::R2));
  LdcWIndexShift.addOperand(MCOperand::createReg(AVR32::R3));
  LdcWIndexShift.addOperand(MCOperand::createImm(2));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(LdcWIndexShift, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xef);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xa2);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x53);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x23);

  MCInst Ldc0DDisp;
  Ldc0DDisp.setOpcode(AVR32::LDC0_D_Disp);
  Ldc0DDisp.addOperand(MCOperand::createImm(0));
  Ldc0DDisp.addOperand(MCOperand::createReg(AVR32::R2));
  Ldc0DDisp.addOperand(MCOperand::createImm(4));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(Ldc0DDisp, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xf3);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xa2);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x00);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x01);

  MCInst Ldc0WDisp;
  Ldc0WDisp.setOpcode(AVR32::LDC0_W_Disp);
  Ldc0WDisp.addOperand(MCOperand::createImm(3));
  Ldc0WDisp.addOperand(MCOperand::createReg(AVR32::R2));
  Ldc0WDisp.addOperand(MCOperand::createImm(8));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(Ldc0WDisp, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xf1);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xa2);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x02);

  MCInst StcDDisp;
  StcDDisp.setOpcode(AVR32::STC_D_Disp);
  StcDDisp.addOperand(MCOperand::createImm(2));
  StcDDisp.addOperand(MCOperand::createReg(AVR32::R2));
  StcDDisp.addOperand(MCOperand::createImm(0));
  StcDDisp.addOperand(MCOperand::createImm(0));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(StcDDisp, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xeb);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xa2);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x50);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x00);

  MCInst StcDPostInc;
  StcDPostInc.setOpcode(AVR32::STC_D_PostInc);
  StcDPostInc.addOperand(MCOperand::createImm(2));
  StcDPostInc.addOperand(MCOperand::createReg(AVR32::R2));
  StcDPostInc.addOperand(MCOperand::createImm(0));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(StcDPostInc, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xef);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xa2);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x40);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x70);

  MCInst StcDIndexShift;
  StcDIndexShift.setOpcode(AVR32::STC_D_IndexShift);
  StcDIndexShift.addOperand(MCOperand::createImm(2));
  StcDIndexShift.addOperand(MCOperand::createReg(AVR32::R2));
  StcDIndexShift.addOperand(MCOperand::createReg(AVR32::R3));
  StcDIndexShift.addOperand(MCOperand::createImm(1));
  StcDIndexShift.addOperand(MCOperand::createImm(0));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(StcDIndexShift, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xef);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xa2);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x50);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0xd3);

  MCInst StcWDisp;
  StcWDisp.setOpcode(AVR32::STC_W_Disp);
  StcWDisp.addOperand(MCOperand::createImm(2));
  StcWDisp.addOperand(MCOperand::createReg(AVR32::R2));
  StcWDisp.addOperand(MCOperand::createImm(4));
  StcWDisp.addOperand(MCOperand::createImm(3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(StcWDisp, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xeb);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xa2);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x43);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x01);

  MCInst StcWPostInc;
  StcWPostInc.setOpcode(AVR32::STC_W_PostInc);
  StcWPostInc.addOperand(MCOperand::createImm(2));
  StcWPostInc.addOperand(MCOperand::createReg(AVR32::R2));
  StcWPostInc.addOperand(MCOperand::createImm(3));

