cozycactus/llvm-project/llvm/unittests/Target/AVR32/TargetInfoTest.cpp
  Printed.clear();
  raw_string_ostream EorEqOS(Printed);
  InstPrinter->printInst(&EorEq, /*Address=*/0, /*Annot=*/"", *STI, EorEqOS);
  EorEqOS.flush();
  EXPECT_EQ(Printed, "\teoreq\tr1, r2, r3");

  Printed.clear();
  raw_string_ostream EorAlOS(Printed);
  InstPrinter->printInst(&EorAl, /*Address=*/0, /*Annot=*/"", *STI, EorAlOS);
  EorAlOS.flush();
  EXPECT_EQ(Printed, "\teoral\tr1, r2, r3");

  Printed.clear();
  raw_string_ostream FrsOS(Printed);
  InstPrinter->printInst(&Frs, /*Address=*/0, /*Annot=*/"", *STI, FrsOS);
  FrsOS.flush();
  EXPECT_EQ(Printed, "\tfrs");

  Printed.clear();
  raw_string_ostream IncjospOS(Printed);
  InstPrinter->printInst(&Incjosp, /*Address=*/0, /*Annot=*/"", *STI,
                         IncjospOS);
  IncjospOS.flush();
  EXPECT_EQ(Printed, "\tincjosp\t-1");

  Printed.clear();
  raw_string_ostream McallOS(Printed);
  InstPrinter->printInst(&Mcall, /*Address=*/0, /*Annot=*/"", *STI, McallOS);
  McallOS.flush();
  EXPECT_EQ(Printed, "\tmcall\tr1[-4]");

  Printed.clear();
  raw_string_ostream LdWPostIncOS(Printed);
  InstPrinter->printInst(&LdWPostInc, /*Address=*/0, /*Annot=*/"", *STI,
                         LdWPostIncOS);
  LdWPostIncOS.flush();
  EXPECT_EQ(Printed, "\tld.w\tr1, r2++");

  Printed.clear();
  raw_string_ostream LdWPreDecOS(Printed);
  InstPrinter->printInst(&LdWPreDec, /*Address=*/0, /*Annot=*/"", *STI,
                         LdWPreDecOS);
  LdWPreDecOS.flush();
  EXPECT_EQ(Printed, "\tld.w\tr1, --r2");

  Printed.clear();
  raw_string_ostream LdWDisp5OS(Printed);
  InstPrinter->printInst(&LdWDisp5, /*Address=*/0, /*Annot=*/"", *STI,
                         LdWDisp5OS);
  LdWDisp5OS.flush();
  EXPECT_EQ(Printed, "\tld.w\tr1, r2[12]");

  Printed.clear();
  raw_string_ostream LdWDisp16OS(Printed);
  InstPrinter->printInst(&LdWDisp16, /*Address=*/0, /*Annot=*/"", *STI,
                         LdWDisp16OS);
  LdWDisp16OS.flush();
  EXPECT_EQ(Printed, "\tld.w\tr1, r2[-1]");

  Printed.clear();
  raw_string_ostream LdWIndexShiftOS(Printed);
  InstPrinter->printInst(&LdWIndexShift, /*Address=*/0, /*Annot=*/"", *STI,
                         LdWIndexShiftOS);
  LdWIndexShiftOS.flush();
  EXPECT_EQ(Printed, "\tld.w\tr1, r2[r3 << 2]");

  Printed.clear();
  raw_string_ostream LdWIndexPartOS(Printed);
  InstPrinter->printInst(&LdWIndexPart, /*Address=*/0, /*Annot=*/"", *STI,
                         LdWIndexPartOS);
  LdWIndexPartOS.flush();
  EXPECT_EQ(Printed, "\tld.w\tr1, r2[r3:l << 2]");

  Printed.clear();
  raw_string_ostream LdWEqDisp9OS(Printed);
  InstPrinter->printInst(&LdWEqDisp9, /*Address=*/0, /*Annot=*/"", *STI,
                         LdWEqDisp9OS);
  LdWEqDisp9OS.flush();
  EXPECT_EQ(Printed, "\tld.weq\tr1, r2[12]");

  Printed.clear();
  raw_string_ostream LdWAlDisp9OS(Printed);
  InstPrinter->printInst(&LdWAlDisp9, /*Address=*/0, /*Annot=*/"", *STI,
                         LdWAlDisp9OS);
  LdWAlDisp9OS.flush();
  EXPECT_EQ(Printed, "\tld.wal\tr1, r2[12]");

  Printed.clear();
  raw_string_ostream LdDPostIncOS(Printed);
  InstPrinter->printInst(&LdDPostInc, /*Address=*/0, /*Annot=*/"", *STI,
                         LdDPostIncOS);
  LdDPostIncOS.flush();
  EXPECT_EQ(Printed, "\tld.d\tr2, r1++");

  Printed.clear();
  raw_string_ostream LdDPreDecOS(Printed);
  InstPrinter->printInst(&LdDPreDec, /*Address=*/0, /*Annot=*/"", *STI,
                         LdDPreDecOS);
  LdDPreDecOS.flush();
  EXPECT_EQ(Printed, "\tld.d\tr2, --r1");

  Printed.clear();
  raw_string_ostream LdDRegOS(Printed);
  InstPrinter->printInst(&LdDReg, /*Address=*/0, /*Annot=*/"", *STI, LdDRegOS);
  LdDRegOS.flush();
  EXPECT_EQ(Printed, "\tld.d\tr2, r1");

  Printed.clear();
  raw_string_ostream LdDDisp16OS(Printed);
  InstPrinter->printInst(&LdDDisp16, /*Address=*/0, /*Annot=*/"", *STI,
                         LdDDisp16OS);
  LdDDisp16OS.flush();
  EXPECT_EQ(Printed, "\tld.d\tr2, r1[-1]");

  Printed.clear();
  raw_string_ostream LdDIndexShiftOS(Printed);
  InstPrinter->printInst(&LdDIndexShift, /*Address=*/0, /*Annot=*/"", *STI,
                         LdDIndexShiftOS);
  LdDIndexShiftOS.flush();
  EXPECT_EQ(Printed, "\tld.d\tr2, r1[r3 << 3]");

  Printed.clear();
  raw_string_ostream LddpcOS(Printed);
  InstPrinter->printInst(&Lddpc, /*Address=*/0, /*Annot=*/"", *STI, LddpcOS);
  LddpcOS.flush();
  EXPECT_EQ(Printed, "\tlddpc\tr2, pc[12]");

  Printed.clear();
  raw_string_ostream LddspOS(Printed);
  InstPrinter->printInst(&Lddsp, /*Address=*/0, /*Annot=*/"", *STI, LddspOS);
  LddspOS.flush();
  EXPECT_EQ(Printed, "\tlddsp\tr2, sp[12]");

  Printed.clear();
  raw_string_ostream LdinsBOS(Printed);
  InstPrinter->printInst(&LdinsB, /*Address=*/0, /*Annot=*/"", *STI,
                         LdinsBOS);
  LdinsBOS.flush();
  EXPECT_EQ(Printed, "\tldins.b\tr1:u, r2[-1]");

  Printed.clear();
  raw_string_ostream LdinsHOS(Printed);
  InstPrinter->printInst(&LdinsH, /*Address=*/0, /*Annot=*/"", *STI,
                         LdinsHOS);
  LdinsHOS.flush();
  EXPECT_EQ(Printed, "\tldins.h\tr1:t, r2[-2]");

  Printed.clear();
  raw_string_ostream LdSBDisp16OS(Printed);
  InstPrinter->printInst(&LdSBDisp16, /*Address=*/0, /*Annot=*/"", *STI,
                         LdSBDisp16OS);
  LdSBDisp16OS.flush();
  EXPECT_EQ(Printed, "\tld.sb\tr1, r2[-1]");

  Printed.clear();
  raw_string_ostream LdSBIndexShiftOS(Printed);
  InstPrinter->printInst(&LdSBIndexShift, /*Address=*/0, /*Annot=*/"", *STI,
                         LdSBIndexShiftOS);
  LdSBIndexShiftOS.flush();
  EXPECT_EQ(Printed, "\tld.sb\tr1, r2[r3 << 2]");

  Printed.clear();
  raw_string_ostream LdSBEqDisp9OS(Printed);
  InstPrinter->printInst(&LdSBEqDisp9, /*Address=*/0, /*Annot=*/"", *STI,
                         LdSBEqDisp9OS);
  LdSBEqDisp9OS.flush();
  EXPECT_EQ(Printed, "\tld.sbeq\tr1, r2[3]");

  Printed.clear();
  raw_string_ostream LdSBAlDisp9OS(Printed);
  InstPrinter->printInst(&LdSBAlDisp9, /*Address=*/0, /*Annot=*/"", *STI,
                         LdSBAlDisp9OS);
  LdSBAlDisp9OS.flush();
  EXPECT_EQ(Printed, "\tld.sbal\tr1, r2[3]");

