cozycactus/llvm-project/llvm/unittests/Target/AVR32/TargetInfoTest.cpp
  Printed.clear();
  raw_string_ostream LdUBPostIncOS(Printed);
  InstPrinter->printInst(&LdUBPostInc, /*Address=*/0, /*Annot=*/"", *STI,
                         LdUBPostIncOS);
  LdUBPostIncOS.flush();
  EXPECT_EQ(Printed, "\tld.ub\tr1, r2++");

  Printed.clear();
  raw_string_ostream LdUBPreDecOS(Printed);
  InstPrinter->printInst(&LdUBPreDec, /*Address=*/0, /*Annot=*/"", *STI,
                         LdUBPreDecOS);
  LdUBPreDecOS.flush();
  EXPECT_EQ(Printed, "\tld.ub\tr1, --r2");

  Printed.clear();
  raw_string_ostream LdUBDisp3OS(Printed);
  InstPrinter->printInst(&LdUBDisp3, /*Address=*/0, /*Annot=*/"", *STI,
                         LdUBDisp3OS);
  LdUBDisp3OS.flush();
  EXPECT_EQ(Printed, "\tld.ub\tr1, r2[3]");

  Printed.clear();
  raw_string_ostream LdUBDisp16OS(Printed);
  InstPrinter->printInst(&LdUBDisp16, /*Address=*/0, /*Annot=*/"", *STI,
                         LdUBDisp16OS);
  LdUBDisp16OS.flush();
  EXPECT_EQ(Printed, "\tld.ub\tr1, r2[-1]");

  Printed.clear();
  raw_string_ostream LdUBIndexShiftOS(Printed);
  InstPrinter->printInst(&LdUBIndexShift, /*Address=*/0, /*Annot=*/"", *STI,
                         LdUBIndexShiftOS);
  LdUBIndexShiftOS.flush();
  EXPECT_EQ(Printed, "\tld.ub\tr1, r2[r3 << 2]");

  Printed.clear();
  raw_string_ostream LdUBEqDisp9OS(Printed);
  InstPrinter->printInst(&LdUBEqDisp9, /*Address=*/0, /*Annot=*/"", *STI,
                         LdUBEqDisp9OS);
  LdUBEqDisp9OS.flush();
  EXPECT_EQ(Printed, "\tld.ubeq\tr1, r2[3]");

  Printed.clear();
  raw_string_ostream LdUBAlDisp9OS(Printed);
  InstPrinter->printInst(&LdUBAlDisp9, /*Address=*/0, /*Annot=*/"", *STI,
                         LdUBAlDisp9OS);
  LdUBAlDisp9OS.flush();
  EXPECT_EQ(Printed, "\tld.ubal\tr1, r2[3]");

  Printed.clear();
  raw_string_ostream LdSHPostIncOS(Printed);
  InstPrinter->printInst(&LdSHPostInc, /*Address=*/0, /*Annot=*/"", *STI,
                         LdSHPostIncOS);
  LdSHPostIncOS.flush();
  EXPECT_EQ(Printed, "\tld.sh\tr1, r2++");

  Printed.clear();
  raw_string_ostream LdSHPreDecOS(Printed);
  InstPrinter->printInst(&LdSHPreDec, /*Address=*/0, /*Annot=*/"", *STI,
                         LdSHPreDecOS);
  LdSHPreDecOS.flush();
  EXPECT_EQ(Printed, "\tld.sh\tr1, --r2");

  Printed.clear();
  raw_string_ostream LdSHDisp3OS(Printed);
  InstPrinter->printInst(&LdSHDisp3, /*Address=*/0, /*Annot=*/"", *STI,
                         LdSHDisp3OS);
  LdSHDisp3OS.flush();
  EXPECT_EQ(Printed, "\tld.sh\tr1, r2[6]");

  Printed.clear();
  raw_string_ostream LdSHDisp16OS(Printed);
  InstPrinter->printInst(&LdSHDisp16, /*Address=*/0, /*Annot=*/"", *STI,
                         LdSHDisp16OS);
  LdSHDisp16OS.flush();
  EXPECT_EQ(Printed, "\tld.sh\tr1, r2[-1]");

  Printed.clear();
  raw_string_ostream LdSHIndexShiftOS(Printed);
  InstPrinter->printInst(&LdSHIndexShift, /*Address=*/0, /*Annot=*/"", *STI,
                         LdSHIndexShiftOS);
  LdSHIndexShiftOS.flush();
  EXPECT_EQ(Printed, "\tld.sh\tr1, r2[r3 << 2]");

  Printed.clear();
  raw_string_ostream LdSHEqDisp9OS(Printed);
  InstPrinter->printInst(&LdSHEqDisp9, /*Address=*/0, /*Annot=*/"", *STI,
                         LdSHEqDisp9OS);
  LdSHEqDisp9OS.flush();
  EXPECT_EQ(Printed, "\tld.sheq\tr1, r2[6]");

  Printed.clear();
  raw_string_ostream LdSHAlDisp9OS(Printed);
  InstPrinter->printInst(&LdSHAlDisp9, /*Address=*/0, /*Annot=*/"", *STI,
                         LdSHAlDisp9OS);
  LdSHAlDisp9OS.flush();
  EXPECT_EQ(Printed, "\tld.shal\tr1, r2[6]");

  Printed.clear();
  raw_string_ostream LdswpSHDisp12OS(Printed);
  InstPrinter->printInst(&LdswpSHDisp12, /*Address=*/0, /*Annot=*/"", *STI,
                         LdswpSHDisp12OS);
  LdswpSHDisp12OS.flush();
  EXPECT_EQ(Printed, "\tldswp.sh\tr1, r2[-2]");

  Printed.clear();
  raw_string_ostream LdswpUHDisp12OS(Printed);
  InstPrinter->printInst(&LdswpUHDisp12, /*Address=*/0, /*Annot=*/"", *STI,
                         LdswpUHDisp12OS);
  LdswpUHDisp12OS.flush();
  EXPECT_EQ(Printed, "\tldswp.uh\tr1, r2[-2]");

  Printed.clear();
  raw_string_ostream LdswpWDisp12OS(Printed);
  InstPrinter->printInst(&LdswpWDisp12, /*Address=*/0, /*Annot=*/"", *STI,
                         LdswpWDisp12OS);
  LdswpWDisp12OS.flush();
  EXPECT_EQ(Printed, "\tldswp.w\tr1, r2[-4]");

  Printed.clear();
  raw_string_ostream LdUHPostIncOS(Printed);
  InstPrinter->printInst(&LdUHPostInc, /*Address=*/0, /*Annot=*/"", *STI,
                         LdUHPostIncOS);
  LdUHPostIncOS.flush();
  EXPECT_EQ(Printed, "\tld.uh\tr1, r2++");

  Printed.clear();
  raw_string_ostream LdUHPreDecOS(Printed);
  InstPrinter->printInst(&LdUHPreDec, /*Address=*/0, /*Annot=*/"", *STI,
                         LdUHPreDecOS);
  LdUHPreDecOS.flush();
  EXPECT_EQ(Printed, "\tld.uh\tr1, --r2");

  Printed.clear();
  raw_string_ostream LdUHDisp3OS(Printed);
  InstPrinter->printInst(&LdUHDisp3, /*Address=*/0, /*Annot=*/"", *STI,
                         LdUHDisp3OS);
  LdUHDisp3OS.flush();
  EXPECT_EQ(Printed, "\tld.uh\tr1, r2[6]");

  Printed.clear();
  raw_string_ostream LdUHDisp16OS(Printed);
  InstPrinter->printInst(&LdUHDisp16, /*Address=*/0, /*Annot=*/"", *STI,
                         LdUHDisp16OS);
  LdUHDisp16OS.flush();
  EXPECT_EQ(Printed, "\tld.uh\tr1, r2[-1]");

  Printed.clear();
  raw_string_ostream LdUHIndexShiftOS(Printed);
  InstPrinter->printInst(&LdUHIndexShift, /*Address=*/0, /*Annot=*/"", *STI,
                         LdUHIndexShiftOS);
  LdUHIndexShiftOS.flush();
  EXPECT_EQ(Printed, "\tld.uh\tr1, r2[r3 << 2]");

  Printed.clear();
  raw_string_ostream LdUHEqDisp9OS(Printed);
  InstPrinter->printInst(&LdUHEqDisp9, /*Address=*/0, /*Annot=*/"", *STI,
                         LdUHEqDisp9OS);
  LdUHEqDisp9OS.flush();
  EXPECT_EQ(Printed, "\tld.uheq\tr1, r2[6]");

  Printed.clear();
  raw_string_ostream LdUHAlDisp9OS(Printed);
  InstPrinter->printInst(&LdUHAlDisp9, /*Address=*/0, /*Annot=*/"", *STI,
                         LdUHAlDisp9OS);
  LdUHAlDisp9OS.flush();
  EXPECT_EQ(Printed, "\tld.uhal\tr1, r2[6]");

