cozycactus/llvm-project/llvm/unittests/Target/AVR32/TargetInfoTest.cpp
  Printed.clear();
  raw_string_ostream MacOS(Printed);
  InstPrinter->printInst(&Mac, /*Address=*/0, /*Annot=*/"", *STI, MacOS);
  MacOS.flush();
  EXPECT_EQ(Printed, "\tmac\tr1, r2, r3");

  Printed.clear();
  raw_string_ostream MacsDOS(Printed);
  InstPrinter->printInst(&MacsD, /*Address=*/0, /*Annot=*/"", *STI, MacsDOS);
  MacsDOS.flush();
  EXPECT_EQ(Printed, "\tmacs.d\tr2, r3, r4");

  Printed.clear();
  raw_string_ostream MacuDOS(Printed);
  InstPrinter->printInst(&MacuD, /*Address=*/0, /*Annot=*/"", *STI, MacuDOS);
  MacuDOS.flush();
  EXPECT_EQ(Printed, "\tmacu.d\tr2, r3, r4");

  Printed.clear();
  raw_string_ostream MachhDOS(Printed);
  InstPrinter->printInst(&MachhD, /*Address=*/0, /*Annot=*/"", *STI,
                         MachhDOS);
  MachhDOS.flush();
  EXPECT_EQ(Printed, "\tmachh.d\tr1, r2:t, r3:b");

  Printed.clear();
  raw_string_ostream MachhWOS(Printed);
  InstPrinter->printInst(&MachhW, /*Address=*/0, /*Annot=*/"", *STI,
                         MachhWOS);
  MachhWOS.flush();
  EXPECT_EQ(Printed, "\tmachh.w\tr1, r2:t, r3:b");

  Printed.clear();
  raw_string_ostream MulhhWOS(Printed);
  InstPrinter->printInst(&MulhhW, /*Address=*/0, /*Annot=*/"", *STI,
                         MulhhWOS);
  MulhhWOS.flush();
  EXPECT_EQ(Printed, "\tmulhh.w\tr1, r2:t, r3:b");

  Printed.clear();
  raw_string_ostream MulnhhWOS(Printed);
  InstPrinter->printInst(&MulnhhW, /*Address=*/0, /*Annot=*/"", *STI,
                         MulnhhWOS);
  MulnhhWOS.flush();
  EXPECT_EQ(Printed, "\tmulnhh.w\tr1, r2:t, r3:b");

  Printed.clear();
  raw_string_ostream MacwhDOS(Printed);
  InstPrinter->printInst(&MacwhD, /*Address=*/0, /*Annot=*/"", *STI,
                         MacwhDOS);
  MacwhDOS.flush();
  EXPECT_EQ(Printed, "\tmacwh.d\tr2, r3, r4:t");

  Printed.clear();
  raw_string_ostream MulnwhDOS(Printed);
  InstPrinter->printInst(&MulnwhD, /*Address=*/0, /*Annot=*/"", *STI,
                         MulnwhDOS);
  MulnwhDOS.flush();
  EXPECT_EQ(Printed, "\tmulnwh.d\tr2, r3, r4:t");

  Printed.clear();
  raw_string_ostream MulwhDOS(Printed);
  InstPrinter->printInst(&MulwhD, /*Address=*/0, /*Annot=*/"", *STI,
                         MulwhDOS);
  MulwhDOS.flush();
  EXPECT_EQ(Printed, "\tmulwh.d\tr2, r3, r4:t");

  Printed.clear();
  raw_string_ostream MacsathhWOS(Printed);
  InstPrinter->printInst(&MacsathhW, /*Address=*/0, /*Annot=*/"", *STI,
                         MacsathhWOS);
  MacsathhWOS.flush();
  EXPECT_EQ(Printed, "\tmacsathh.w\tr1, r2:t, r3:b");

  Printed.clear();
  raw_string_ostream MulsathhHOS(Printed);
  InstPrinter->printInst(&MulsathhH, /*Address=*/0, /*Annot=*/"", *STI,
                         MulsathhHOS);
  MulsathhHOS.flush();
  EXPECT_EQ(Printed, "\tmulsathh.h\tr1, r2:t, r3:b");

  Printed.clear();
  raw_string_ostream MulsathhWOS(Printed);
  InstPrinter->printInst(&MulsathhW, /*Address=*/0, /*Annot=*/"", *STI,
                         MulsathhWOS);
  MulsathhWOS.flush();
  EXPECT_EQ(Printed, "\tmulsathh.w\tr1, r2:t, r3:b");

  Printed.clear();
  raw_string_ostream MulsatrndhhHOS(Printed);
  InstPrinter->printInst(&MulsatrndhhH, /*Address=*/0, /*Annot=*/"", *STI,
                         MulsatrndhhHOS);
  MulsatrndhhHOS.flush();
  EXPECT_EQ(Printed, "\tmulsatrndhh.h\tr1, r2:t, r3:b");

  Printed.clear();
  raw_string_ostream MulsatrndwhWOS(Printed);
  InstPrinter->printInst(&MulsatrndwhW, /*Address=*/0, /*Annot=*/"", *STI,
                         MulsatrndwhWOS);
  MulsatrndwhWOS.flush();
  EXPECT_EQ(Printed, "\tmulsatrndwh.w\tr2, r3, r4:t");

  Printed.clear();
  raw_string_ostream MulsatwhWOS(Printed);
  InstPrinter->printInst(&MulsatwhW, /*Address=*/0, /*Annot=*/"", *STI,
                         MulsatwhWOS);
  MulsatwhWOS.flush();
  EXPECT_EQ(Printed, "\tmulsatwh.w\tr2, r3, r4:t");

  Printed.clear();
  raw_string_ostream DivsOS(Printed);
  InstPrinter->printInst(&Divs, /*Address=*/0, /*Annot=*/"", *STI, DivsOS);
  DivsOS.flush();
  EXPECT_EQ(Printed, "\tdivs\tr2, r3, r4");

  Printed.clear();
  raw_string_ostream DivuOS(Printed);
  InstPrinter->printInst(&Divu, /*Address=*/0, /*Annot=*/"", *STI, DivuOS);
  DivuOS.flush();
  EXPECT_EQ(Printed, "\tdivu\tr2, r3, r4");

  Printed.clear();
  raw_string_ostream MusfrOS(Printed);
  InstPrinter->printInst(&Musfr, /*Address=*/0, /*Annot=*/"", *STI, MusfrOS);
  MusfrOS.flush();
  EXPECT_EQ(Printed, "\tmusfr\tr1");

  Printed.clear();
  raw_string_ostream MustrOS(Printed);
  InstPrinter->printInst(&Mustr, /*Address=*/0, /*Annot=*/"", *STI, MustrOS);
  MustrOS.flush();
  EXPECT_EQ(Printed, "\tmustr\tr1");

  Printed.clear();
  raw_string_ostream MtdrOS(Printed);
  InstPrinter->printInst(&Mtdr, /*Address=*/0, /*Annot=*/"", *STI, MtdrOS);
  MtdrOS.flush();
  EXPECT_EQ(Printed, "\tmtdr\t4, r1");

  Printed.clear();
  raw_string_ostream MtsrOS(Printed);
  InstPrinter->printInst(&Mtsr, /*Address=*/0, /*Annot=*/"", *STI, MtsrOS);
  MtsrOS.flush();
  EXPECT_EQ(Printed, "\tmtsr\t4, r1");

  Printed.clear();
  raw_string_ostream MemcOS(Printed);
  InstPrinter->printInst(&Memc, /*Address=*/0, /*Annot=*/"", *STI, MemcOS);
  MemcOS.flush();
  EXPECT_EQ(Printed, "\tmemc\t4, 1");

  Printed.clear();
  raw_string_ostream MemsOS(Printed);
  InstPrinter->printInst(&Mems, /*Address=*/0, /*Annot=*/"", *STI, MemsOS);
  MemsOS.flush();
  EXPECT_EQ(Printed, "\tmems\t4, 1");

  Printed.clear();
  raw_string_ostream MemtOS(Printed);
  InstPrinter->printInst(&Memt, /*Address=*/0, /*Annot=*/"", *STI, MemtOS);
  MemtOS.flush();
  EXPECT_EQ(Printed, "\tmemt\t4, 1");

  Printed.clear();
  raw_string_ostream OrOS(Printed);
  InstPrinter->printInst(&Or, /*Address=*/0, /*Annot=*/"", *STI, OrOS);
  OrOS.flush();
  EXPECT_EQ(Printed, "\tor\tr1, r2");

  Printed.clear();
  raw_string_ostream OrhOS(Printed);
  InstPrinter->printInst(&Orh, /*Address=*/0, /*Annot=*/"", *STI, OrhOS);
  OrhOS.flush();
  EXPECT_EQ(Printed, "\torh\tr1, 1");

  Printed.clear();
  raw_string_ostream OrlOS(Printed);
  InstPrinter->printInst(&Orl, /*Address=*/0, /*Annot=*/"", *STI, OrlOS);
  OrlOS.flush();
  EXPECT_EQ(Printed, "\torl\tr1, 1");

