cozycactus/llvm-project/llvm/unittests/Target/AVR32/TargetInfoTest.cpp
  Printed.clear();
  raw_string_ostream PrefOS(Printed);
  InstPrinter->printInst(&Pref, /*Address=*/0, /*Annot=*/"", *STI, PrefOS);
  PrefOS.flush();
  EXPECT_EQ(Printed, "\tpref\tr1[-1]");

  Printed.clear();
  raw_string_ostream PabsSBOS(Printed);
  InstPrinter->printInst(&PabsSB, /*Address=*/0, /*Annot=*/"", *STI, PabsSBOS);
  PabsSBOS.flush();
  EXPECT_EQ(Printed, "\tpabs.sb\tr1, r2");

  Printed.clear();
  raw_string_ostream PabsSHOS(Printed);
  InstPrinter->printInst(&PabsSH, /*Address=*/0, /*Annot=*/"", *STI, PabsSHOS);
  PabsSHOS.flush();
  EXPECT_EQ(Printed, "\tpabs.sh\tr1, r2");

  Printed.clear();
  raw_string_ostream PackshUBOS(Printed);
  InstPrinter->printInst(&PackshUB, /*Address=*/0, /*Annot=*/"", *STI,
                         PackshUBOS);
  PackshUBOS.flush();
  EXPECT_EQ(Printed, "\tpacksh.ub\tr1, r2, r3");

  Printed.clear();
  raw_string_ostream PackshSBOS(Printed);
  InstPrinter->printInst(&PackshSB, /*Address=*/0, /*Annot=*/"", *STI,
                         PackshSBOS);
  PackshSBOS.flush();
  EXPECT_EQ(Printed, "\tpacksh.sb\tr1, r2, r3");

  Printed.clear();
  raw_string_ostream PackwSHOS(Printed);
  InstPrinter->printInst(&PackwSH, /*Address=*/0, /*Annot=*/"", *STI,
                         PackwSHOS);
  PackwSHOS.flush();
  EXPECT_EQ(Printed, "\tpackw.sh\tr1, r2, r3");

  Printed.clear();
  raw_string_ostream PaddBOS(Printed);
  InstPrinter->printInst(&PaddB, /*Address=*/0, /*Annot=*/"", *STI, PaddBOS);
  PaddBOS.flush();
  EXPECT_EQ(Printed, "\tpadd.b\tr1, r2, r3");

  Printed.clear();
  raw_string_ostream PaddHOS(Printed);
  InstPrinter->printInst(&PaddH, /*Address=*/0, /*Annot=*/"", *STI, PaddHOS);
  PaddHOS.flush();
  EXPECT_EQ(Printed, "\tpadd.h\tr1, r2, r3");

  Printed.clear();
  raw_string_ostream PaddhUBOS(Printed);
  InstPrinter->printInst(&PaddhUB, /*Address=*/0, /*Annot=*/"", *STI,
                         PaddhUBOS);
  PaddhUBOS.flush();
  EXPECT_EQ(Printed, "\tpaddh.ub\tr1, r2, r3");

  Printed.clear();
  raw_string_ostream PaddhSHOS(Printed);
  InstPrinter->printInst(&PaddhSH, /*Address=*/0, /*Annot=*/"", *STI,
                         PaddhSHOS);
  PaddhSHOS.flush();
  EXPECT_EQ(Printed, "\tpaddh.sh\tr1, r2, r3");

  Printed.clear();
  raw_string_ostream PaddsUBOS(Printed);
  InstPrinter->printInst(&PaddsUB, /*Address=*/0, /*Annot=*/"", *STI,
                         PaddsUBOS);
  PaddsUBOS.flush();
  EXPECT_EQ(Printed, "\tpadds.ub\tr1, r2, r3");

  Printed.clear();
  raw_string_ostream PaddsSBOS(Printed);
  InstPrinter->printInst(&PaddsSB, /*Address=*/0, /*Annot=*/"", *STI,
                         PaddsSBOS);
  PaddsSBOS.flush();
  EXPECT_EQ(Printed, "\tpadds.sb\tr1, r2, r3");

  Printed.clear();
  raw_string_ostream PaddsUHOS(Printed);
  InstPrinter->printInst(&PaddsUH, /*Address=*/0, /*Annot=*/"", *STI,
                         PaddsUHOS);
  PaddsUHOS.flush();
  EXPECT_EQ(Printed, "\tpadds.uh\tr1, r2, r3");

  Printed.clear();
  raw_string_ostream PaddsSHOS(Printed);
  InstPrinter->printInst(&PaddsSH, /*Address=*/0, /*Annot=*/"", *STI,
                         PaddsSHOS);
  PaddsSHOS.flush();
  EXPECT_EQ(Printed, "\tpadds.sh\tr1, r2, r3");

  Printed.clear();
  raw_string_ostream PaddsubHOS(Printed);
  InstPrinter->printInst(&PaddsubH, /*Address=*/0, /*Annot=*/"", *STI,
                         PaddsubHOS);
  PaddsubHOS.flush();
  EXPECT_EQ(Printed, "\tpaddsub.h\tr1, r2:t, r3:b");

  Printed.clear();
  raw_string_ostream PaddsubhSHOS(Printed);
  InstPrinter->printInst(&PaddsubhSH, /*Address=*/0, /*Annot=*/"", *STI,
                         PaddsubhSHOS);
  PaddsubhSHOS.flush();
  EXPECT_EQ(Printed, "\tpaddsubh.sh\tr1, r2:t, r3:b");

  Printed.clear();
  raw_string_ostream PaddsubsUHOS(Printed);
  InstPrinter->printInst(&PaddsubsUH, /*Address=*/0, /*Annot=*/"", *STI,
                         PaddsubsUHOS);
  PaddsubsUHOS.flush();
  EXPECT_EQ(Printed, "\tpaddsubs.uh\tr1, r2:t, r3:b");

  Printed.clear();
  raw_string_ostream PaddsubsSHOS(Printed);
  InstPrinter->printInst(&PaddsubsSH, /*Address=*/0, /*Annot=*/"", *STI,
                         PaddsubsSHOS);
  PaddsubsSHOS.flush();
  EXPECT_EQ(Printed, "\tpaddsubs.sh\tr1, r2:t, r3:b");

  Printed.clear();
  raw_string_ostream PaddxHOS(Printed);
  InstPrinter->printInst(&PaddxH, /*Address=*/0, /*Annot=*/"", *STI,
                         PaddxHOS);
  PaddxHOS.flush();
  EXPECT_EQ(Printed, "\tpaddx.h\tr1, r2, r3");

  Printed.clear();
  raw_string_ostream PaddxhSHOS(Printed);
  InstPrinter->printInst(&PaddxhSH, /*Address=*/0, /*Annot=*/"", *STI,
                         PaddxhSHOS);
  PaddxhSHOS.flush();
  EXPECT_EQ(Printed, "\tpaddxh.sh\tr1, r2, r3");

  Printed.clear();
  raw_string_ostream PaddxsUHOS(Printed);
  InstPrinter->printInst(&PaddxsUH, /*Address=*/0, /*Annot=*/"", *STI,
                         PaddxsUHOS);
  PaddxsUHOS.flush();
  EXPECT_EQ(Printed, "\tpaddxs.uh\tr1, r2, r3");

  Printed.clear();
  raw_string_ostream PaddxsSHOS(Printed);
  InstPrinter->printInst(&PaddxsSH, /*Address=*/0, /*Annot=*/"", *STI,
                         PaddxsSHOS);
  PaddxsSHOS.flush();
  EXPECT_EQ(Printed, "\tpaddxs.sh\tr1, r2, r3");

  Printed.clear();
  raw_string_ostream PasrBOS(Printed);
  InstPrinter->printInst(&PasrB, /*Address=*/0, /*Annot=*/"", *STI, PasrBOS);
  PasrBOS.flush();
  EXPECT_EQ(Printed, "\tpasr.b\tr1, r2, 3");

  Printed.clear();
  raw_string_ostream PasrHOS(Printed);
  InstPrinter->printInst(&PasrH, /*Address=*/0, /*Annot=*/"", *STI, PasrHOS);
  PasrHOS.flush();
  EXPECT_EQ(Printed, "\tpasr.h\tr1, r2, 15");

  Printed.clear();
  raw_string_ostream PlslBOS(Printed);
  InstPrinter->printInst(&PlslB, /*Address=*/0, /*Annot=*/"", *STI, PlslBOS);
  PlslBOS.flush();
  EXPECT_EQ(Printed, "\tplsl.b\tr1, r2, 3");

  Printed.clear();
  raw_string_ostream PlslHOS(Printed);
  InstPrinter->printInst(&PlslH, /*Address=*/0, /*Annot=*/"", *STI, PlslHOS);
  PlslHOS.flush();
  EXPECT_EQ(Printed, "\tplsl.h\tr1, r2, 15");

  Printed.clear();
  raw_string_ostream PlsrBOS(Printed);
  InstPrinter->printInst(&PlsrB, /*Address=*/0, /*Annot=*/"", *STI, PlsrBOS);
  PlsrBOS.flush();
  EXPECT_EQ(Printed, "\tplsr.b\tr1, r2, 3");

