cozycactus/llvm-project/llvm/unittests/Target/AVR32/TargetInfoTest.cpp
  MCContext SubRegImmParseCtx(TT, *MAI, *MRI, *STI, &SubRegImmSrcMgr);
  std::unique_ptr<MCObjectFileInfo> SubRegImmMOFI(
      TheTarget->createMCObjectFileInfo(SubRegImmParseCtx, /*PIC=*/false));
  SubRegImmParseCtx.setObjectFileInfo(SubRegImmMOFI.get());

  std::unique_ptr<MCStreamer> SubRegImmStreamer(
      TheTarget->createNullStreamer(SubRegImmParseCtx));
  std::unique_ptr<MCAsmParser> SubRegImmParser(createMCAsmParser(
      SubRegImmSrcMgr, SubRegImmParseCtx, *SubRegImmStreamer, *MAI));
  std::unique_ptr<MCTargetAsmParser> SubRegImmTargetParser(
      TheTarget->createMCAsmParser(*STI, *SubRegImmParser, *MII));
  ASSERT_NE(SubRegImmTargetParser.get(), nullptr);
  SubRegImmParser->setTargetParser(*SubRegImmTargetParser);
  EXPECT_FALSE(SubRegImmParser->Run(/*NoInitialTextSection=*/false));

  SourceMgr StoreSrcMgr;
  StoreSrcMgr.AddNewSourceBuffer(
      MemoryBuffer::getMemBuffer(
          "ld.w r1, r2++\nld.w r1, --r2\nld.w r1, r2[12]\n"
          "ld.w r1, r2[-1]\nld.w r1, r2[r3 << 2]\n"
          "ld.w r1, r2[r3:l << 2]\n"
          "ld.weq r1, r2[12]\nld.wal r1, r2[12]\n"
          "ld.d r2, r1++\nld.d r2, --r1\nld.d r2, r1\n"
          "ld.d r2, r1[-1]\nld.d r2, r1[r3 << 3]\n"
          "ldcm.d cp2, r2, cr0-cr3\n"
          "ldcm.d cp2, r2++, cr0-cr3\n"
          "ldcm.w cp2, r2, cr2-cr5\n"
          "ldcm.w cp2, r2++, cr8-cr11\n"
          "lddpc r2, pc[12]\nlddsp r2, sp[12]\n"
          "ldins.b r1:u, r2[-1]\nldins.h r1:t, r2[-2]\n"
          "ld.sb r1, r2[-1]\nld.sb r1, r2[r3 << 2]\n"
          "ld.sbeq r1, r2[3]\nld.sbal r1, r2[3]\n"
          "ld.ub r1, r2++\nld.ub r1, --r2\nld.ub r1, r2[3]\n"
          "ld.ub r1, r2[-1]\nld.ub r1, r2[r3 << 2]\n"
          "ld.ubeq r1, r2[3]\nld.ubal r1, r2[3]\n"
          "ld.sh r1, r2++\nld.sh r1, --r2\nld.sh r1, r2[6]\n"
          "ld.sh r1, r2[-1]\nld.sh r1, r2[r3 << 2]\n"
          "ld.sheq r1, r2[6]\nld.shal r1, r2[6]\n"
          "ldswp.sh r1, r2[-2]\nldswp.uh r1, r2[-2]\n"
          "ldswp.w r1, r2[-4]\n"
          "ld.uh r1, r2++\nld.uh r1, --r2\nld.uh r1, r2[6]\n"
          "ld.uh r1, r2[-1]\nld.uh r1, r2[r3 << 2]\n"
          "ld.uheq r1, r2[6]\nld.uhal r1, r2[6]\n"
          "st.b r1++, r2\nst.b --r1, r2\nst.b r1[3], r2\n"
          "st.b r1[-1], r2\nst.b r1[r2 << 3], r4\n"
          "st.beq r1[3], r2\nst.bal r1[3], r2\n"
          "st.d r1++, r2\nst.d --r1, r2\nst.d r1, r2\n"
          "st.d r1[-1], r2\nst.d r1[r2 << 3], r4\n"
          "stcm.d cp2, r2, cr0-cr3\n"
          "stcm.d cp2, --r2, cr0-cr3\n"
          "stcm.w cp2, r2, cr8-cr11\n"
          "stcm.w cp2, --r2, cr2-cr5\n"
          "st.h r1++, r2\nst.h --r1, r2\nst.h r1[6], r2\n"
          "st.h r1[-1], r2\nst.h r1[r2 << 3], r4\n"
          "st.heq r1[6], r2\nst.hal r1[6], r2\n"
          "st.w r1++, r2\nst.w --r1, r2\nst.w r1[12], r2\n"
          "st.w r1[-1], r2\nst.w r1[r2 << 3], r4\n"
          "st.weq r1[12], r2\nst.wal r1[12], r2\n"
          "ldc.d cp2, cr0, r2[r3 << 1]\n"
          "ldc.w cp2, cr3, r2[r3 << 2]\n"
          "stc.d cp2, r2[r3 << 1], cr0\n"
          "stc.w cp2, r2[r3 << 2], cr3\n"
          "stcond r1[-1], r2\nstdsp sp[12], r2\n"
          "sthh.w r1[12], r2:t, r3:b\n"
          "sthh.w r1[r4 << 3], r2:t, r3:b\n"
          "stswp.h r1[-2], r2\nstswp.w r1[-4], r2\n"),
      SMLoc());

  MCContext StoreParseCtx(TT, *MAI, *MRI, *STI, &StoreSrcMgr);
  std::unique_ptr<MCObjectFileInfo> StoreMOFI(
      TheTarget->createMCObjectFileInfo(StoreParseCtx, /*PIC=*/false));
  StoreParseCtx.setObjectFileInfo(StoreMOFI.get());

  std::unique_ptr<MCStreamer> StoreStreamer(
      TheTarget->createNullStreamer(StoreParseCtx));
  std::unique_ptr<MCAsmParser> StoreParser(
      createMCAsmParser(StoreSrcMgr, StoreParseCtx, *StoreStreamer, *MAI));
  std::unique_ptr<MCTargetAsmParser> StoreTargetParser(
      TheTarget->createMCAsmParser(*STI, *StoreParser, *MII));
  ASSERT_NE(StoreTargetParser.get(), nullptr);
  StoreParser->setTargetParser(*StoreTargetParser);
  EXPECT_FALSE(StoreParser->Run(/*NoInitialTextSection=*/false));

  SourceMgr PrefSrcMgr;
  PrefSrcMgr.AddNewSourceBuffer(
      MemoryBuffer::getMemBuffer("cache r1[-1], 1\npref r1[-1]\n"), SMLoc());

  MCContext PrefParseCtx(TT, *MAI, *MRI, *STI, &PrefSrcMgr);
  std::unique_ptr<MCObjectFileInfo> PrefMOFI(
      TheTarget->createMCObjectFileInfo(PrefParseCtx, /*PIC=*/false));
  PrefParseCtx.setObjectFileInfo(PrefMOFI.get());

  std::unique_ptr<MCStreamer> PrefStreamer(
      TheTarget->createNullStreamer(PrefParseCtx));
  std::unique_ptr<MCAsmParser> PrefParser(
      createMCAsmParser(PrefSrcMgr, PrefParseCtx, *PrefStreamer, *MAI));
  std::unique_ptr<MCTargetAsmParser> PrefTargetParser(
      TheTarget->createMCAsmParser(*STI, *PrefParser, *MII));
  ASSERT_NE(PrefTargetParser.get(), nullptr);
  PrefParser->setTargetParser(*PrefTargetParser);
  EXPECT_FALSE(PrefParser->Run(/*NoInitialTextSection=*/false));

  SourceMgr PsadSrcMgr;
  PsadSrcMgr.AddNewSourceBuffer(
      MemoryBuffer::getMemBuffer(
          "pabs.sb r1, r2\npabs.sh r1, r2\n"
          "packsh.ub r1, r2, r3\npacksh.sb r1, r2, r3\n"
          "packw.sh r1, r2, r3\n"
          "padd.b r1, r2, r3\npadd.h r1, r2, r3\n"
          "paddh.ub r1, r2, r3\npaddh.sh r1, r2, r3\n"
          "padds.ub r1, r2, r3\npadds.sb r1, r2, r3\n"
          "padds.uh r1, r2, r3\npadds.sh r1, r2, r3\n"
          "paddx.h r1, r2, r3\npaddxh.sh r1, r2, r3\n"
          "paddxs.uh r1, r2, r3\npaddxs.sh r1, r2, r3\n"
          "pasr.b r1, r2, 3\npasr.h r1, r2, 15\n"
          "plsl.b r1, r2, 3\nplsl.h r1, r2, 15\n"
          "plsr.b r1, r2, 3\nplsr.h r1, r2, 15\n"
          "pavg.ub r1, r2, r3\npavg.sh r1, r2, r3\n"
          "pmax.ub r1, r2, r3\npmax.sh r1, r2, r3\n"
          "pmin.ub r1, r2, r3\npmin.sh r1, r2, r3\n"
          "psad r1, r2, r3\npsub.b r1, r2, r3\npsub.h r1, r2, r3\n"
          "psubh.ub r1, r2, r3\npsubh.sh r1, r2, r3\n"
          "psubs.ub r1, r2, r3\npsubs.sb r1, r2, r3\n"
          "psubs.uh r1, r2, r3\npsubs.sh r1, r2, r3\n"
          "psubx.h r1, r2, r3\npsubxh.sh r1, r2, r3\n"
          "psubxs.uh r1, r2, r3\npsubxs.sh r1, r2, r3\n"),
      SMLoc());

  MCContext PsadParseCtx(TT, *MAI, *MRI, *STI, &PsadSrcMgr);
  std::unique_ptr<MCObjectFileInfo> PsadMOFI(
      TheTarget->createMCObjectFileInfo(PsadParseCtx, /*PIC=*/false));
  PsadParseCtx.setObjectFileInfo(PsadMOFI.get());

  std::unique_ptr<MCStreamer> PsadStreamer(
      TheTarget->createNullStreamer(PsadParseCtx));
  std::unique_ptr<MCAsmParser> PsadParser(
      createMCAsmParser(PsadSrcMgr, PsadParseCtx, *PsadStreamer, *MAI));
  std::unique_ptr<MCTargetAsmParser> PsadTargetParser(
      TheTarget->createMCAsmParser(*STI, *PsadParser, *MII));
  ASSERT_NE(PsadTargetParser.get(), nullptr);
  PsadParser->setTargetParser(*PsadTargetParser);
  EXPECT_FALSE(PsadParser->Run(/*NoInitialTextSection=*/false));

  SourceMgr PsubaddSrcMgr;
  PsubaddSrcMgr.AddNewSourceBuffer(
      MemoryBuffer::getMemBuffer(
          "machh.d r1, r2:t, r3:b\nmachh.w r1, r2:t, r3:b\n"
          "macsathh.w r1, r2:t, r3:b\n"
          "macwh.d r2, r3, r4:t\nmulnwh.d r2, r3, r4:t\n"
          "mulhh.w r1, r2:t, r3:b\nmulnhh.w r1, r2:t, r3:b\n"
          "mulsathh.h r1, r2:t, r3:b\nmulsathh.w r1, r2:t, r3:b\n"
          "mulsatrndhh.h r1, r2:t, r3:b\n"
          "mulsatrndwh.w r2, r3, r4:t\nmulsatwh.w r2, r3, r4:t\n"
          "mulwh.d r2, r3, r4:t\n"
          "paddsub.h r1, r2:t, r3:b\npaddsubh.sh r1, r2:t, r3:b\n"
          "paddsubs.uh r1, r2:t, r3:b\npaddsubs.sh r1, r2:t, r3:b\n"
          "psubadd.h r1, r2:t, r3:b\npsubaddh.sh r1, r2:t, r3:b\n"
          "psubadds.uh r1, r2:t, r3:b\npsubadds.sh r1, r2:t, r3:b\n"
          "punpckub.h r1, r2:b\npunpcksb.h r1, r2:t\n"),
      SMLoc());

  MCContext PsubaddParseCtx(TT, *MAI, *MRI, *STI, &PsubaddSrcMgr);
  std::unique_ptr<MCObjectFileInfo> PsubaddMOFI(
      TheTarget->createMCObjectFileInfo(PsubaddParseCtx, /*PIC=*/false));
  PsubaddParseCtx.setObjectFileInfo(PsubaddMOFI.get());

  std::unique_ptr<MCStreamer> PsubaddStreamer(
      TheTarget->createNullStreamer(PsubaddParseCtx));
  std::unique_ptr<MCAsmParser> PsubaddParser(createMCAsmParser(
      PsubaddSrcMgr, PsubaddParseCtx, *PsubaddStreamer, *MAI));
  std::unique_ptr<MCTargetAsmParser> PsubaddTargetParser(
      TheTarget->createMCAsmParser(*STI, *PsubaddParser, *MII));
  ASSERT_NE(PsubaddTargetParser.get(), nullptr);
  PsubaddParser->setTargetParser(*PsubaddTargetParser);
  EXPECT_FALSE(PsubaddParser->Run(/*NoInitialTextSection=*/false));
}

} // namespace
